
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>1. 认识算法 · 从零开始学算法</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="tiankonguse">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="alg-problem-type-division.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    0. 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="alg-base.html">
            
                <a href="alg-base.html">
            
                    
                    1. 认识算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="alg-problem-type-division.html">
            
                <a href="alg-problem-type-division.html">
            
                    
                    2. 了解套路长啥样
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="base-sort.html">
            
                <a href="base-sort.html">
            
                    
                    3. 排序算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="binary-search.html">
            
                <a href="binary-search.html">
            
                    
                    4. 二分查找
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="full-array.html">
            
                <a href="full-array.html">
            
                    
                    5. 万能数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="link.html">
            
                <a href="link.html">
            
                    
                    6. 链表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="skip-list.html">
            
                <a href="skip-list.html">
            
                    
                    7. 跳表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="summon-dragon.html">
            
                <a href="summon-dragon.html">
            
                    
                    8. 召唤神龙
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="last.md">
            
                <span>
            
                    
                    9. 后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >1. 认识算法</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x6211;&#x662F;tiankonguse&#x3002;<br>&#x7531;&#x4E8E;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x7ECF;&#x5E38;&#x6709;&#x4EBA;&#x60F3;&#x8981;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x5DF1;&#x4E4B;&#x524D;&#x53C8;&#x6CA1;&#x6709;&#x76F8;&#x5173;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x4F55;&#x505A;&#x8D77;&#x3002;<br>&#x6211;&#x601D;&#x8003;&#x4E86;&#x8BB8;&#x4E45;&#xFF0C;&#x8BA1;&#x5212;&#x5199;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#x6765;&#x5206;&#x4EAB;&#x5982;&#x4F55;&#x5165;&#x95E8;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/03/20180314011635.jpg" alt="">  </p>
<p>&#x7B2C;&#x4E00;&#x7BC7;&#x81EA;&#x7136;&#x662F;&#x8BA4;&#x8BC6;&#x7B97;&#x6CD5;&#x3002;  </p>
<p>&#x8BA4;&#x8BC6;&#x7B97;&#x6CD5;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x7279;&#x70B9;&#x5BF9;&#x4E8E;&#x65B0;&#x624B;&#x6765;&#x8BF4;&#x76F8;&#x5F53;&#x91CD;&#x8981;&#x3002;  </p>
<p>&#x7279;&#x70B9;1&#xFF1A;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x4E07;&#x80FD;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x4F60;&#x544A;&#x8BC9;&#x5979;&#x7684;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#x3002;<br>&#x7279;&#x70B9;2&#xFF1A;&#x8BA1;&#x7B97;&#x673A;&#x662F;&#x4F4E;&#x80FD;&#x7684;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x6309;&#x7167;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x89C4;&#x5219;&#x5E76;&#x6E05;&#x6E05;&#x695A;&#x695A;&#x7684;&#x544A;&#x8BC9;&#x5979;&#x5982;&#x4F55;&#x4E00;&#x6B65;&#x6B65;&#x505A;&#x4E8B;&#x60C5;&#x3002;<br>&#x7279;&#x70B9;3&#xFF1A;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x6765;&#x63A7;&#x5236;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x4E5F;&#x662F;&#x4E07;&#x80FD;&#x7684;&#x548C;&#x4F4E;&#x80FD;&#x7684;&#x3002;  </p>
<p>&#x4E0A;&#x9762;&#x7684;&#x4E24;&#x4E2A;&#x7279;&#x70B9;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4F46;&#x662F;&#x65B0;&#x624B;&#x5F80;&#x5F80;&#x4F1A;&#x5728;&#x8FD9;&#x4E0A;&#x9762;&#x8017;&#x8D39;&#x5F88;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x3002;<br>&#x4F60;&#x60F3;&#x63A7;&#x5236;&#x4E07;&#x80FD;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x6709;&#x5F3A;&#x5927;&#x7684;&#x601D;&#x7EF4;&#x80FD;&#x529B;&#x3001;&#x903B;&#x8F91;&#x80FD;&#x529B;&#x3001;&#x5206;&#x6790;&#x80FD;&#x529B;&#x3002;<br>&#x4F60;&#x60F3;&#x63A7;&#x5236;&#x4F4E;&#x80FD;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x6709;&#x7EC6;&#x5FC3;&#x3001;&#x8010;&#x5FC3;&#x3001;&#x826F;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x89C4;&#x8303;&#x3001;&#x7EDF;&#x4E00;&#x4EE3;&#x7801;&#x98CE;&#x683C;&#x3002;  </p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x5C1D;&#x8BD5;&#x63A7;&#x5236;&#x4F4E;&#x80FD;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5427;&#x3002;<br>&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x901A;&#x8FC7;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6765;&#x64CD;&#x4F5C;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x800C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x6709;&#x540C;&#x6837;&#x7684;&#x7279;&#x70B9;&#x3002;
&#x4E0B;&#x9762;&#x4F9D;&#x6B21;&#x8BA9;&#x5927;&#x5BB6;&#x6765;&#x6162;&#x6162;&#x9002;&#x5E94;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5427;&#x3002;   </p>
<h2 id="&#x4E00;&#x3001;&#x8F93;&#x5165;&#x8F93;&#x51FA;">&#x4E00;&#x3001;&#x8F93;&#x5165;&#x8F93;&#x51FA;</h2>
<p>&#x9762;&#x5BF9;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x5C31;&#x662F;&#x5B66;&#x4F1A;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;<br>&#x5B66;&#x4F1A;&#x4E86;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x548C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4EA4;&#x4E92;&#x4E86;&#x3002;<br>&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5B66;&#x4E60;&#x6BCF;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x505A;&#x7684;&#x7B2C;&#x4E00;&#x4EF6;&#x4E8B;&#x90FD;&#x662F;&#x8F93;&#x51FA;&#x201C;hello word!&#x201D;&#x3002;  </p>
<p>&#x5BF9;&#x4E8E;c/c++&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x662F;&#x901A;&#x8FC7;&#x952E;&#x76D8;&#x8F93;&#x5165;&#x7684;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x51FD;&#x6570;&#x662F;scanf&#x3002;<br>&#x800C;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x662F;&#x901A;&#x8FC7;&#x5C4F;&#x5E55;&#x8F93;&#x51FA;&#x7684;&#xFF0C;&#x5BF9;&#x5E94;&#x7684;&#x51FD;&#x6570;&#x662F;printf&#x3002; 
&#x5F53;&#x7136;&#xFF0C;&#x5E38;&#x7528;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x51FD;&#x6570; <code>getchar,putchar,gets,puts</code>&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x5B57;&#x7B26;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x548C;&#x884C;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x3002;<br><code>cin</code>&#x548C;<code>cout</code>&#x662F;c++&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x8BED;&#x6CD5;&#xFF0C;&#x7531;&#x4E8E;&#x6027;&#x80FD;&#x6BD4;&#x8F83;&#x4F4E;&#x4EE5;&#x53CA;&#x8F93;&#x51FA;&#x683C;&#x5F0F;&#x63A7;&#x5236;&#x4E0D;&#x65B9;&#x4FBF;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x4F7F;&#x7528;&#x3002;  </p>
<p>ACM&#x6BD4;&#x8D5B;&#x4E2D;&#x4E00;&#x822C;&#x952E;&#x76D8;&#x5C31;&#x662F;&#x6807;&#x51C6;&#x8F93;&#x5165;&#x548C;&#x5C4F;&#x5E55;&#x5C31;&#x662F;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#xFF0C;&#x6240;&#x4EE5;&#x76F4;&#x63A5;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x5C31;&#x884C;&#x4E86;&#x3002;<br>&#x4F46;&#x662F;&#x5BF9;&#x4E8E;OI&#x6216;&#x8005;&#x5176;&#x4ED6;&#x6BD4;&#x8D5B;&#xFF0C;&#x8981;&#x6C42;&#x4ECE;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x8F93;&#x51FA;&#x548C;&#x6307;&#x5B9A;&#x6587;&#x4EF6;&#x8F93;&#x51FA;&#x3002;
&#x6B64;&#x65F6;&#x6BD4;&#x8F83;&#x65B9;&#x4FBF;&#x7684;&#x505A;&#x6CD5;&#x662F;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x548C;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x91CD;&#x5B9A;&#x5411;&#x5230;&#x6587;&#x4EF6;&#xFF0C;&#x5373;&#x4E0B;&#x9762;&#x7684;&#x505A;&#x6CD5;&#x3002;  </p>
<pre><code>int main(){
    freopen(&quot;input.txt&quot;, &quot;r&quot;, stdin);
    freopen(&quot;output.txt&quot;, &quot;w&quot;, stdout);

    //scanf&#x6216;cin &#x8F93;&#x51FA;
    //&#x7B97;&#x6CD5;
    //printf&#x6216;cout&#x8F93;&#x51FA;

    return 0;
}
</code></pre><p>&#x5BF9;&#x4E8E;<code>scanf</code>&#x548C;<code>printf</code>&#x5E38;&#x7528;&#x7684;&#x683C;&#x5F0F;&#x6709;<code>%d %lld %c %s %lf</code>&#x5206;&#x522B;&#x4EE3;&#x8868;32&#x6574;&#x6570;&#xFF0C;64&#x4F4D;&#x6574;&#x6570;&#xFF0C;&#x5B57;&#x7B26;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x548C;double&#x6D6E;&#x70B9;&#x578B;&#x3002;<br>&#x9664;&#x4E86;<code>%c</code>&#x5B57;&#x7B26;&#x5916;&#xFF0C;&#x5176;&#x4ED6;&#x8F93;&#x5165;&#x90FD;&#x53EF;&#x4EE5;&#x81EA;&#x52A8;&#x8DF3;&#x8FC7;&#x7A7A;&#x767D;&#x5B57;&#x7B26;&#x3002;<br>&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x76F8;&#x5173;&#x7684;&#x5C31;&#x662F;<code>long</code>&#x548C;<code>float</code>&#x4E86;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E2D;&#x7981;&#x6B62;&#x4F7F;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x7C7B;&#x578B;&#xFF0C;&#x7531;&#x4E8E;&#x542B;&#x4E49;&#x4E0D;&#x6E05;&#x6670;&#xFF0C;&#x5F88;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002;  </p>
<p>&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x770B;&#x5B8C;&#x4E86;&#xFF0C;&#x4E0B;&#x9762;&#x5C31;&#x6765;&#x770B;&#x770B;&#x6BD4;&#x8D5B;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x5427;&#x3002;  </p>
<h2 id="&#x4E8C;&#x3001;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x5165;">&#x4E8C;&#x3001;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x5165;</h2>
<p>&#x6BD4;&#x8D5B;&#x7684;&#x8F93;&#x5165;&#x5176;&#x5B9E;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x89C4;&#x5219;&#xFF0C;&#x6211;&#x4EEC;&#x6309;&#x89C4;&#x5219;&#x6267;&#x884C;&#x5C31;&#x884C;&#x4E86;&#x3002;<br>&#x4F46;&#x662F;&#x5F88;&#x591A;&#x65B0;&#x4EBA;&#x4E0D;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x9075;&#x5B88;&#x89C4;&#x5219;&#xFF0C;&#x5BFC;&#x81F4;&#x57FA;&#x672C;&#x7684;&#x8F93;&#x5165;&#x90FD;&#x505A;&#x4E0D;&#x5230;&#x3002;  </p>
<p>&#x6837;&#x4F8B;1&#xFF1A;&#x4E0D;&#x77E5;&#x9053;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#xFF0C;&#x76F4;&#x5230;&#x8BFB;&#x5230;&#x6587;&#x4EF6;&#x7ED3;&#x5C3E;&#x4E3A;&#x6B62;&#x3002;<br>&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://acm.hdu.edu.cn/showproblem.php?pid=1089" target="_blank">http://acm.hdu.edu.cn/showproblem.php?pid=1089</a>  </p>
<pre><code>while(scanf(&quot;%d %d&quot;,&amp;a, &amp;b) != EOF){

}
</code></pre><p>&#x6837;&#x4F8B;2&#xFF1A;&#x544A;&#x8BC9;&#x4F60;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x6570;&#x636E;&#x6837;&#x4F8B;&#xFF0C; &#x7136;&#x540E;&#x4F60;&#x5FAA;&#x73AF;&#x68B3;&#x7406;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x636E;&#x5373;&#x53EF;&#x3002;<br>&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://acm.hdu.edu.cn/showproblem.php?pid=1090" target="_blank">http://acm.hdu.edu.cn/showproblem.php?pid=1090</a>  </p>
<p>&#x6837;&#x4F8B;3&#xFF1A;&#x4E0D;&#x544A;&#x8BC9;&#x4F60;&#x6709;&#x591A;&#x5C11;&#x4E2A;&#x6837;&#x4F8B;&#xFF0C;&#x4F46;&#x662F;&#x544A;&#x8BC9;&#x4F60;&#x4EE5;&#x4EC0;&#x4E48;&#x5F62;&#x5F0F;&#x7ED3;&#x675F;&#x3002;<br>&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://acm.hdu.edu.cn/showproblem.php?pid=1091" target="_blank">http://acm.hdu.edu.cn/showproblem.php?pid=1091</a>  </p>
<p>&#x6837;&#x4F8B;4&#xFF1A; &#x8F93;&#x5165;&#x542B;&#x6709;&#x7A7A;&#x683C;&#x7684;&#x5B57;&#x7B26;&#x4E32;<br>&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://acm.hdu.edu.cn/showproblem.php?pid=1048" target="_blank">http://acm.hdu.edu.cn/showproblem.php?pid=1048</a></p>
<pre><code>char buf[20]; 
while(gets(buf)){

}
</code></pre><p>&#x6837;&#x4F8B;5&#xFF1A;&#x6DF7;&#x5408;&#x578B;  </p>
<p>&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://acm.hdu.edu.cn/showproblem.php?pid=1092" target="_blank">http://acm.hdu.edu.cn/showproblem.php?pid=1092</a>
&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://acm.hdu.edu.cn/showproblem.php?pid=1093" target="_blank">http://acm.hdu.edu.cn/showproblem.php?pid=1093</a>
&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://acm.hdu.edu.cn/showproblem.php?pid=1094" target="_blank">http://acm.hdu.edu.cn/showproblem.php?pid=1094</a></p>
<h2 id="&#x4E8C;&#x3001;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x51FA;">&#x4E8C;&#x3001;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x51FA;</h2>
<p>&#x6BD4;&#x8D5B;&#x7684;&#x8F93;&#x51FA;&#x4E5F;&#x662F;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x8F93;&#x51FA;&#x5373;&#x4F7F;&#x5DEE;&#x4E00;&#x4E2A;&#x7A7A;&#x683C;&#x6216;&#x6362;&#x884C;&#x7B26;&#x4E5F;&#x4E0D;&#x884C;&#x7684;&#x3002;   </p>
<p>&#x6837;&#x4F8B;1&#xFF1A;&#x6B63;&#x5E38;&#x7684;&#x4E00;&#x884C;&#x4E00;&#x4E2A;&#x7B54;&#x6848;&#x578B;<br>&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://acm.hdu.edu.cn/showproblem.php?pid=1089" target="_blank">http://acm.hdu.edu.cn/showproblem.php?pid=1089</a></p>
<p>&#x6837;&#x4F8B;2&#xFF1A;&#x6BCF;&#x7EC4;&#x6570;&#x636E;&#x540E;&#x4E00;&#x4E2A;&#x7A7A;&#x884C;&#x578B;<br>&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://acm.hdu.edu.cn/showproblem.php?pid=1095" target="_blank">http://acm.hdu.edu.cn/showproblem.php?pid=1095</a></p>
<p>&#x6837;&#x4F8B;3&#xFF1A;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x6709;&#x4E00;&#x4E2A;&#x7A7A;&#x884C;&#x578B;<br>&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://acm.hdu.edu.cn/showproblem.php?pid=1096" target="_blank">http://acm.hdu.edu.cn/showproblem.php?pid=1096</a>  </p>
<p>&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x6DF7;&#x5408;&#x578B;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x548C;&#x5404;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x8F93;&#x5165;&#x6DF7;&#x642D;&#x5728;&#x4E00;&#x8D77;&#x7684;&#xFF0C;&#x76F8;&#x4FE1;&#x5927;&#x5BB6;&#x7EC3;&#x4E60;&#x4E86;&#x4E0A;&#x9762;&#x7684;&#x5404;&#x79CD;&#x7C7B;&#x578B;&#x95EE;&#x9898;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x90FD;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x4E86;&#x3002;   </p>
<h2 id="&#x4E09;&#x3001;&#x7B97;&#x6CD5;&#x7684;&#x5957;&#x8DEF;">&#x4E09;&#x3001;&#x7B97;&#x6CD5;&#x7684;&#x5957;&#x8DEF;</h2>
<p>&#x5728;&#x5927;&#x5BB6;&#x7ECF;&#x5386;&#x4E86;&#x4E0A;&#x9762;&#x75DB;&#x82E6;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x8FC7;&#x7A0B;&#x540E;&#xFF0C;&#x76F8;&#x4FE1;&#x5927;&#x5BB6;&#x90FD;&#x521D;&#x6B65;&#x517B;&#x6210;&#x4E86;&#x7EC6;&#x5FC3;&#x3001;&#x8010;&#x5FC3;&#x3001;&#x575A;&#x6301;&#x7684;&#x597D;&#x4E60;&#x60EF;&#x3002;<br>&#x63A5;&#x4E0B;&#x6765;&#x9700;&#x8981;&#x953B;&#x70BC;&#x7684;&#x662F;&#x66F4;&#x9AD8;&#x7EA7;&#x7684;&#x80FD;&#x529B;&#xFF1A;&#x5206;&#x6790;&#x95EE;&#x9898;&#x80FD;&#x529B;&#x3001;&#x903B;&#x8F91;&#x80FD;&#x529B;&#x3002;  </p>
<p>&#x6211;&#x4EEC;&#x9762;&#x5BF9;&#x4E00;&#x9053;&#x9898;&#x3001;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x77E5;&#x9053;&#x9898;&#x7684;&#x542B;&#x4E49;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;<br>&#x4E5F;&#x5C31;&#x662F;&#x8F93;&#x5165;&#x6709;&#x4EC0;&#x4E48;&#x3001;&#x8F93;&#x51FA;&#x9700;&#x8981;&#x662F;&#x4EC0;&#x4E48;&#x3002;<br>&#x7136;&#x540E;&#x60F3;&#x60F3;&#x600E;&#x4E48;&#x505A;&#xFF0C;&#x5373;&#x5206;&#x54EA;&#x4E9B;&#x6B65;&#x9AA4;&#x628A;&#x6570;&#x636E;&#x4ECE;&#x8F93;&#x5165;&#x8F6C;&#x5316;&#x4E3A;&#x8F93;&#x51FA;&#x3002;  </p>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x9AD8;&#x7CBE;&#x5EA6;&#x52A0;&#x6CD5;&#x5BF9;&#x521D;&#x5B66;&#x8005;&#x6765;&#x8BF4;&#x662F;&#x6700;&#x597D;&#x7684;&#x7EC3;&#x4E60;&#x9898;&#x4E86;&#x3002;  </p>
<p>&#x95EE;&#x9898;&#xFF1A;&#x8F93;&#x5165;&#x4E24;&#x4E2A;&#x6B63;&#x6574;&#x6570;&#xFF0C;&#x6570;&#x5B57;&#x7684;&#x4F4D;&#x6570;&#x6700;&#x5927;&#x662F;10000&#x4F4D;&#xFF0C;&#x6C42;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#x4E4B;&#x548C;&#x3002;<br>&#x5927;&#x5BB6;&#x601D;&#x8003;&#x51E0;&#x5206;&#x949F;&#x3002;&#x770B;&#x770B;&#x8F93;&#x5165;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x600E;&#x4E48;&#x50A8;&#x5B58;&#x3002;&#x8F93;&#x51FA;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x600E;&#x4E48;&#x50A8;&#x5B58;&#x3002;<br>&#x7136;&#x540E;&#x662F;&#x600E;&#x4E48;&#x7531;&#x8F93;&#x5165;&#x8BA1;&#x7B97;&#x51FA;&#x8F93;&#x51FA;&#x3002;  </p>
<p>&#x8F93;&#x5165;&#x662F;&#x4E24;&#x4E2A;&#x5927;&#x6574;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x6574;&#x6570;&#x53D8;&#x91CF;&#x50A8;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x4F7F;&#x7528;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x50A8;&#x5B58;&#x8D77;&#x6765;&#x3002;<br>&#x6240;&#x4EE5;&#x8F93;&#x5165;&#x7684;&#x662F;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;  </p>
<p>&#x8F93;&#x5165;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x6574;&#x6570;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8F93;&#x51FA;&#x7684;&#x7B54;&#x6848;&#x4E5F;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x5B57;&#x7B26;&#x4E32;&#x4FDD;&#x5B58;&#x8D77;&#x6765;&#x3002;  </p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x50CF;&#x8FD9;&#x4E2A;&#x6837;&#x5B50;&#x3002;  </p>
<pre><code>
const int maxn = 11111;

void readData(char* first, char* second){
    scanf(&quot;%s %s&quot;, first, second);
}

void calAns(char* first, char* second, char* ans){
    //&#x8BA1;&#x7B97;&#x903B;&#x8F91;
}


void writeData(char* ans){
    printf(&quot;%s\n&quot;, ans);
}

int main(){
    char first[maxn], second[maxn], ans[maxn];

    readData(first, second);
    calAns(first, second, ans);
    writeData(ans);

    return 0;
}
</code></pre><p>&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#xFF1A;&#x6211;&#x4EEC;&#x600E;&#x4E48;&#x5BF9;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6C42;&#x548C;&#x5462;&#xFF1F;<br>&#x8FD9;&#x65F6;&#x5019;&#x5C31;&#x8981;&#x89C2;&#x5BDF;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x7279;&#x5F81;&#x4E86;&#xFF0C;&#x5047;&#x8BBE;&#x8F93;&#x5165;&#x7684;&#x6570;&#x5B57;&#x662F;&quot;1234567&quot;&#x548C;&quot;12345678&quot;&#xFF0C;&#x6211;&#x4EEC;&#x8F6C;&#x5316;&#x4E3A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5F62;&#x5F0F;&#x3002;  </p>
<pre><code>&#x4E0B;&#x6807;:   0123456
&#x4F4D;&#x6570; :  7654321
first : 1234567

&#x4E0B;&#x6807;:   01234567
&#x4F4D;&#x6570; :  87654321
second: 12345678
</code></pre><p>&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x8F93;&#x5165;&#x7684;&#x5927;&#x6574;&#x6570;&#xFF0C;&#x6570;&#x5B57;&#x7684;&#x9AD8;&#x4F4D;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x5730;&#x4F4D;&#x5728;&#x540E;&#x9762;&#xFF0C;&#x4F8B;&#x5982;&#x4E2A;&#x4F4D;&#x5728;&#x6700;&#x540E;&#x3002;<br>&#x6211;&#x4EEC;&#x5E73;&#x5E38;&#x76F8;&#x52A0;&#x4E24;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x662F;&#x4ECE;&#x4E2A;&#x6570;&#x5F00;&#x59CB;&#x52A0;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6D89;&#x53CA;&#x5230;&#x8FDB;&#x4F4D;&#x3002;<br>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x628A;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x5316;&#x4E3A;&#x4E2A;&#x4F4D;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x9AD8;&#x4F4D;&#x5728;&#x540E;&#x9762;&#x5C31;&#x597D;&#x4E86;&#x3002;<br>&#x800C;&#x8FD9;&#x4E2A;&#x8F6C;&#x5316;&#x5C31;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x7FFB;&#x8F6C;&#x3002;  </p>
<pre><code>&#x4E0B;&#x6807;:   0123456
&#x4F4D;&#x6570; :  1234567
first : 7654321

&#x4E0B;&#x6807;:   01234567
&#x4F4D;&#x6570; :  12345678
second: 87654321
</code></pre><p>&#x7136;&#x540E;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5C31;&#x53EF;&#x4EE5;&#x5BF9;&#x9F50;&#x4E86;&#x3002;  </p>
<pre><code>&#x4E0B;&#x6807;:   01234567
&#x4F4D;&#x6570; :  12345678
first : 7654321 
second: 87654321
</code></pre><p>&#x6211;&#x4EEC;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x4F9D;&#x6B21;&#x76F8;&#x52A0;&#xFF0C;&#x5982;&#x679C;&#x6D89;&#x53CA;&#x5230;&#x8FDB;&#x4F4D;&#xFF0C;&#x4E0B;&#x4E00;&#x4F4D;&#x5C31;&#x52A0;&#x4E00;&#x3002;<br>&#x524D;&#x9762;&#x7684;&#x6B63;&#x5E38;&#x5FAA;&#x73AF;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#xFF0C;&#x5230;&#x4E86;&#x6700;&#x540E;&#xFF0C;&#x53D1;&#x73B0;&#x6709;&#x70B9;&#x9EBB;&#x70E6;&#x3002;<br>&#x56E0;&#x4E3A;&#x6D89;&#x53CA;&#x597D;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;1+1&#x3001;3+7&#x3001;1+11&#x3001;5+51&#x7B49;&#x3002;  </p>
<p>&#x9762;&#x5BF9;&#x8FD9;&#x4E9B;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x5206;&#x522B;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x76F8;&#x4FE1;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x5904;&#x7406;&#x4E0D;&#x8FC7;&#x6765;&#x3002;<br>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5206;&#x6B65;&#x9AA4;&#x5904;&#x7406;&#x3002;    </p>
<p>&#x5C31;&#x50CF;1+11&#xFF0C;&#x7B2C;&#x4E8C;&#x4F4D;&#x4E00;&#x4E2A;&#x662F;&#x7A7A;&#xFF0C;&#x4E00;&#x4E2A;&#x6709;&#x6570;&#x5B57;&#xFF0C;&#x600E;&#x4E48;&#x76F8;&#x52A0;&#x5462;&#xFF1F;<br>&#x7B54;&#x6848;&#x662F;&#x7A7A;&#x7684;&#x6309;0&#x5904;&#x7406;&#x3002;  </p>
<p>&#x5BF9;&#x4E8E;&#x53E6;&#x4E00;&#x79CD;&#x60C5;&#x51B5;3+7&#xFF0C;&#x8FDB;&#x884C;&#x4E86;&#x8FDB;&#x4F4D;&#xFF0C;&#x4E4B;&#x540E;&#x6CA1;&#x6709;&#x4E0B;&#x4E00;&#x4F4D;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x5904;&#x7406;&#x5462;&#xFF1F;<br>&#x7B54;&#x6848;&#x662F;&#x4E0B;&#x4E00;&#x4F4D;&#x90FD;&#x6309;0&#x5904;&#x7406;&#x5373;&#x53EF;&#x3002;  </p>
<p>&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x60F3;&#x80FD;&#x4E0D;&#x80FD;&#x63D0;&#x524D;&#x9884;&#x5904;&#x7406;&#xFF0C;&#x4E0D;&#x7BA1;&#x7B54;&#x6848;&#x662F;&#x5426;&#x6D89;&#x53CA;&#x7A7A;&#x4F4D;&#xFF0C;&#x63D0;&#x524D;&#x8865;&#x9F50;0&#xFF0C;&#x6700;&#x540E;&#x518D;&#x53BB;&#x6389;&#x65E0;&#x5173;&#x7684;0&#x5373;&#x53EF;&#x3002;<br>&#x6240;&#x4EE5;&#x5C31;&#x5F97;&#x51FA;&#x4E0B;&#x9762;&#x7684;&#x7ED3;&#x679C;&#x3002;  </p>
<p>&#x8BA1;&#x7B97;&#x6B65;&#x9AA4;&#x4E3A;&#xFF1A;&#x5F97;&#x5230;&#x6700;&#x5927;&#x4F4D;&#x6570;&#x52A0;1&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x4E0D;&#x8DB3;&#x4F4D;&#x6570;&#x7684;&#x4F4D;&#x7F6E;&#x586B;&#x5145;0.  </p>
<pre><code>&#x4E0B;&#x6807;:   012345678
&#x4F4D;&#x6570; :  123456789
first : 765432100 
second: 876543210
</code></pre><p>&#x7136;&#x540E;&#x5C31;&#x662F;&#x6B63;&#x5E38;&#x7684;&#x5FAA;&#x73AF;&#x52A0;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x5FAA;&#x73AF;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x7ED3;&#x675F;&#x4E86;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x3002;  </p>
<pre><code>&#x4E0B;&#x6807;:   012345678
&#x4F4D;&#x6570; :  123456789
first : 765432100 
second: 876543210
ans:    542085310
</code></pre><p>&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4F1A;&#x53D1;&#x73B0;&#x7B54;&#x6848;&#x7684;&#x9AD8;&#x4F4D;&#x6709;&#x524D;&#x5BFC;0&#xFF0C; &#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5904;&#x7406;&#x4E00;&#x4E0B;&#x53BB;&#x6389;&#x524D;&#x5BFC;0.  </p>
<pre><code>542085310 =&#x300B; 54208531
</code></pre><p>&#x8FD9;&#x91CC;&#x5C31;&#x5F97;&#x5230;&#x4E86;&#x7B54;&#x6848;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x7B54;&#x6848;&#x7684;&#x4E2A;&#x4F4D;&#x5728;&#x524D;&#x9762;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x8F93;&#x51FA;&#x7684;&#x7B54;&#x6848;&#x4E2A;&#x6570;&#x5E94;&#x8BE5;&#x5728;&#x540E;&#x9762;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x518D;&#x6B21;&#x7FFB;&#x8F6C;&#x5B57;&#x7B26;&#x4E32;&#x3002;  </p>
<pre><code>54208531 =&#x300B; 13580245
</code></pre><p>&#x4E0A;&#x9762;&#x51E0;&#x4E2A;&#x5C0F;&#x8282;&#x7684;&#x7EC3;&#x4E60;&#x90FD;&#x662F;&#x82F1;&#x6587;&#xFF0C;&#x5927;&#x5BB6;&#x5F88;&#x4E0D;&#x4E60;&#x60EF;&#x5427;&#x3002;<br>&#x4E3A;&#x6B64;&#x6211;&#x627E;&#x4E86;&#x4E00;&#x4E2A;&#x4E2D;&#x6587;&#x7684;&#x7EC3;&#x4E60;&#x7F51;&#x7AD9;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53BB;&#x8FD9;&#x91CC;&#x7EC3;&#x4E60;&#x4E00;&#x4E0B;&#x5927;&#x6574;&#x6570;&#x52A0;&#x6CD5;&#x5427;&#x3002;<br>&#x7EC3;&#x4E60;&#x5730;&#x5740;&#xFF1A;<a href="http://oj.noi.cn/oj/#main/show/1138" target="_blank">http://oj.noi.cn/oj/#main/show/1138</a>  </p>
<hr>
<p>&#x8FD9;&#x662F;&#x4ECE;&#x96F6;&#x5F00;&#x59CB;&#x5B66;&#x7B97;&#x6CD5;&#x7684;&#x7B2C;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002;<br>&#x5982;&#x679C;&#x4F60;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x52A0;&#x5165;&#x6211;&#x7684;&#x77E5;&#x8BC6;&#x661F;&#x7403;&#x8FDB;&#x884C;&#x63D0;&#x95EE;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/suanfa_xiaomiquan.jpg" alt="">  </p>
<p>&#x5927;&#x5BB6;&#x5982;&#x679C;&#x6709;&#x4EC0;&#x4E48;&#x5EFA;&#x8BAE;&#x6216;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x5728;&#x5E95;&#x90E8;&#x7559;&#x8A00;&#x533A;&#x7559;&#x8A00;&#x3002;<br>&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x52A0;&#x6211;&#x5FAE;&#x4FE1;&#x627E;&#x6211;&#x79C1;&#x804A;&#xFF0C;&#x5FAE;&#x4FE1;&#x53F7;: tiankonguse&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/tiankonguse-support.png" alt="">  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 0. 简介">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="alg-problem-type-division.html" class="navigation navigation-next " aria-label="Next page: 2. 了解套路长啥样">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"1. 认识算法","level":"1.2","depth":1,"next":{"title":"2. 了解套路长啥样","level":"1.3","depth":1,"path":"alg-problem-type-division.md","ref":"alg-problem-type-division.md","articles":[]},"previous":{"title":"0. 简介","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"plugins":["search","highlight","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"highlight":{},"livereload":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"language ":"zh-hans","theme":"default","author":"tiankonguse","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"从零开始学算法","gitbook":"*","description":"这是一本介绍算法的书籍。虽然名字是从零开始学算法，但是需要你有一定的计算机基础才行。","theme-default":{"showLevel":true}},"file":{"path":"alg-base.md","mtime":"2019-07-11T17:46:51.222Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-07-11T17:56:11.220Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

