
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3. 排序算法 · 从零开始学算法</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="tiankonguse">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="binary-search.html" />
    
    
    <link rel="prev" href="alg-problem-type-division.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    0. 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="alg-base.html">
            
                <a href="alg-base.html">
            
                    
                    1. 认识算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="alg-problem-type-division.html">
            
                <a href="alg-problem-type-division.html">
            
                    
                    2. 了解套路长啥样
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="base-sort.html">
            
                <a href="base-sort.html">
            
                    
                    3. 排序算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="binary-search.html">
            
                <a href="binary-search.html">
            
                    
                    4. 二分查找
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="full-array.html">
            
                <a href="full-array.html">
            
                    
                    5. 万能数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="link.html">
            
                <a href="link.html">
            
                    
                    6. 链表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="skip-list.html">
            
                <a href="skip-list.html">
            
                    
                    7. 跳表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="summon-dragon.html">
            
                <a href="summon-dragon.html">
            
                    
                    8. 召唤神龙
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="last.md">
            
                <span>
            
                    
                    9. 后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >3. 排序算法</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x4E00;&#x3001;&#x80CC;&#x666F;">&#x4E00;&#x3001;&#x80CC;&#x666F;</h2>
<p>&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x6211;&#x662F;tiankonguse&#x3002;<br>&#x7531;&#x4E8E;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x7ECF;&#x5E38;&#x6709;&#x4EBA;&#x60F3;&#x8981;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x81EA;&#x5DF1;&#x4E4B;&#x524D;&#x53C8;&#x6CA1;&#x6709;&#x76F8;&#x5173;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x4F55;&#x505A;&#x8D77;&#x3002;
&#x6211;&#x601D;&#x8003;&#x4E86;&#x8BB8;&#x4E45;&#xFF0C;&#x8BA1;&#x5212;&#x5199;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#x6765;&#x5206;&#x4EAB;&#x5982;&#x4F55;&#x5165;&#x95E8;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x3002;  </p>
<p>&#x4E0A;&#x534A;&#x5E74;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5206;&#x4EAB;&#x4E86;&#x300A;<a href="https://mp.weixin.qq.com/s/2CyGYZ5SFs-cLBHkxAhdyg" target="_blank">&#x8BA4;&#x8BC6;&#x7B97;&#x6CD5;</a>&#x300B;&#x548C;&#x300A;<a href="https://mp.weixin.qq.com/s/2CyGYZ5SFs-cLBHkxAhdyg" target="_blank">&#x4E86;&#x89E3;&#x5957;&#x8DEF;&#x957F;&#x5565;&#x6837;</a>&#x300B;&#xFF0C;&#x672C;&#x60F3;&#x63A5;&#x4E0B;&#x6765;&#x6309;&#x4E13;&#x9898;&#x8FDB;&#x884C;&#x5206;&#x4EAB;&#xFF0C;&#x601D;&#x8003;&#x826F;&#x4E45;&#x5374;&#x53D1;&#x73B0;&#x5BF9;&#x4E8E;&#x7B97;&#x6CD5;&#xFF0C;&#x5199;&#x6587;&#x7AE0;&#x4E0D;&#x592A;&#x597D;&#x8BB2;&#x6E05;&#x695A;&#xFF0C;&#x5F53;&#x9762;&#x8BB2;&#x6216;&#x8005;&#x89C6;&#x9891;&#x8BB2;&#x6548;&#x679C;&#x624D;&#x662F;&#x6700;&#x4F73;&#x7684;&#x3002;<br>&#x53E6;&#x5916;&#x5927;&#x90E8;&#x5206;&#x7B97;&#x6CD5;&#x611F;&#x89C9;&#x592A;&#x7B80;&#x5355;&#xFF0C;&#x5E7F;&#x5EA6;&#x4E0E;&#x6DF1;&#x5EA6;&#x90FD;&#x4E0D;&#x597D;&#x628A;&#x63E1;&#xFF0C;&#x4E8E;&#x662F;&#x81EA;&#x5DF1;&#x5185;&#x5FC3;&#x6BD4;&#x8F83;&#x77DB;&#x76FE;&#xFF0C;&#x7EA0;&#x7ED3;&#x4E86;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x5C31;&#x7ED9;&#x803D;&#x6401;&#x4E86;&#x3002;  </p>
<p>&#x73B0;&#x5728;&#x53C8;&#x5230;&#x4E86;&#x5F00;&#x5B66;&#x5B63;&#xFF0C;&#x7B97;&#x6CD5;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x62FE;&#x8D77;&#x6765;&#xFF0C;&#x8FD9;&#x91CC;&#x4EE5;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x4F5C;&#x4E3A;&#x5C1D;&#x8BD5;&#x5427;&#x3002;  </p>
<h2 id="&#x4E8C;&#x3001;&#x57FA;&#x672C;&#x77E5;&#x8BC6;">&#x4E8C;&#x3001;&#x57FA;&#x672C;&#x77E5;&#x8BC6;</h2>
<p>&#x6392;&#x5E8F;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x4E00;&#x4E32;&#x6570;&#x636E;&#x6309;&#x7167;&#x7279;&#x5B9A;&#x7684;&#x6392;&#x5E8F;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6392;&#x5217;&#x7684;&#x4E00;&#x79CD;&#x7B97;&#x6CD5;&#x3002;<br>&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x7684;&#x8F93;&#x51FA;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x4E24;&#x4E2A;&#x539F;&#x5219;&#xFF1A;&#x8F93;&#x51FA;&#x5E8F;&#x5217;&#x6709;&#x5E8F;&#x3001;&#x8F93;&#x51FA;&#x5E8F;&#x5217;&#x662F;&#x8F93;&#x5165;&#x5E8F;&#x5217;&#x7684;&#x4E00;&#x79CD;&#x6392;&#x5217;&#x7EC4;&#x5408;&#x3002;    </p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x662F;&#x901A;&#x7528;&#x7684;&#xFF0C;&#x4E0D;&#x7BA1;&#x4EC0;&#x4E48;&#x6570;&#x636E;&#xFF0C;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x90FD;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x9884;&#x671F;&#x7ED3;&#x679C;&#x3002;<br>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x4F7F;&#x7528;&#x6574;&#x6570;&#x5E8F;&#x5217;&#x4F5C;&#x4E3A;&#x4F8B;&#x5B50;&#x6765;&#x5206;&#x6790;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x662F;&#x5982;&#x4F55;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x6392;&#x5E8F;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x6574;&#x6570;&#x6EE1;&#x8DB3;&#x9012;&#x589E;&#x3002;<br>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x5206;&#x522B;&#x6765;&#x770B;&#x770B;&#x5E38;&#x89C1;&#x7684;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x5427;&#x3002;  </p>
<h2 id="&#x4E09;&#x3001;&#x5192;&#x6CE1;&#x6392;&#x5E8F;">&#x4E09;&#x3001;&#x5192;&#x6CE1;&#x6392;&#x5E8F;</h2>
<p>&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#x662F;&#x4E00;&#x79CD;&#x6700;&#x5BB9;&#x6613;&#x7406;&#x89E3;&#x7684;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#x3002;<br>&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x5982;&#x4E0B;&#xFF1A;  </p>
<p>1.&#x6BD4;&#x8F83;&#x76F8;&#x90BB;&#x5143;&#x7D20;&#xFF0C;&#x5982;&#x679C;&#x7B2C;&#x4E00;&#x4E2A;&#x6BD4;&#x7B2C;&#x4E8C;&#x4E2A;&#x5927;&#xFF0C;&#x5C31;&#x4EA4;&#x6362;&#x4ED6;&#x4EEC;&#x3002;<br>2.&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x76F8;&#x90BB;&#x7684;&#x5143;&#x7D20;&#x505A;&#x540C;&#x6837;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x5230;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x3002;&#x505A;&#x5B8C;&#x4E4B;&#x540E;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5C31;&#x662F;&#x6700;&#x5927;&#x503C;&#x3002;
3.&#x9488;&#x5BF9;&#x6240;&#x6709;&#x5143;&#x7D20;&#x91CD;&#x590D;&#x4EE5;&#x4E0A;&#x6B65;&#x9AA4;&#xFF0C;&#x9664;&#x4E86;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x3002;<br>4.&#x6301;&#x7EED;&#x6B65;&#x9AA4;1~3&#xFF0C;&#x6BCF;&#x6B21;&#x90FD;&#x4F1A;&#x5C11;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x76F4;&#x5230;&#x5269;&#x4F59;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x4E3A;&#x6B62;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/2018-09-16-bubblesort.png" alt=""></p>
<p>&#x5982;&#x4E0A;&#x56FE;&#xFF0C;&#x5916;&#x5C42;&#x5FAA;&#x73AF;&#x6BCF;&#x6267;&#x884C;&#x4E00;&#x6B21;&#xFF0C; [0, i] &#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x82E5;&#x5E72;&#x6B21;&#x4EA4;&#x6362;&#xFF0C;i &#x4F4D;&#x7F6E;&#x53D8;&#x6210;&#x4E86;&#x6700;&#x5927;&#x503C;&#x3002;<br>&#x5982;&#x679C;&#x4F60;&#x770B;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x73B0; i &#x662F;&#x4ECE;&#x5C0F;&#x5230;&#x5927;&#x5FAA;&#x73AF;&#x7684;&#xFF0C;&#x5176;&#x5B9E;&#x4F1A;&#x53D1;&#x73B0;&#x4ECE;&#x5927;&#x5230;&#x5C0F;&#x4F1A;&#x66F4;&#x6E05;&#x6670;&#x3002;<br>&#x590D;&#x6742;&#x5EA6;&#xFF1A;&#x7531;&#x4E8E;&#x6709;&#x4E24;&#x5C42;&#x5FAA;&#x73AF;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6BCF;&#x6B21;&#x6BD4;&#x4E0A;&#x6B21;&#x5C11;&#x5FAA;&#x73AF;1 &#x6B21;&#xFF0C; &#x4E0D;&#x8FC7;&#x590D;&#x6742;&#x5EA6;&#x8FD8;&#x662F; O(n^2)&#x3002;  </p>
<h2 id="&#x56DB;&#x3001;&#x9009;&#x62E9;&#x6392;&#x5E8F;">&#x56DB;&#x3001;&#x9009;&#x62E9;&#x6392;&#x5E8F;</h2>
<p>&#x9009;&#x62E9;&#x6392;&#x5E8F;&#x548C;&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#x60F3;&#x6CD5;&#x5F88;&#x50CF;&#xFF0C;&#x90FD;&#x662F;&#x5FAA;&#x73AF;&#x5E8F;&#x5217;&#xFF0C;&#x4F7F;&#x5F97;&#x5F53;&#x524D;&#x7684;&#x5E8F;&#x5217;&#x7684;&#x6700;&#x5927;&#x503C;&#x5904;&#x4E8E;&#x4E00;&#x7AEF;&#x3002;<br>&#x5148;&#x770B;&#x5192;&#x6CE1;&#x6392;&#x5E8F;&#xFF0C;&#x4F9D;&#x6B21;&#x6BD4;&#x8F83;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x6EE1;&#x8DB3;&#x589E;&#x5E8F;&#xFF0C;&#x4F1A;&#x4FEE;&#x6539;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x7684;&#x503C;&#x3002;<br>&#x800C;&#x9009;&#x62E9;&#x6392;&#x5E8F;&#x5219;&#x662F;&#x6BCF;&#x6B21;&#x6311;&#x51FA;&#x6700;&#x5927;&#x503C;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x7136;&#x540E;&#x53EA;&#x4EA4;&#x6362;&#x4E00;&#x6B21;&#x3002;  </p>
<p>&#x5177;&#x4F53;&#x601D;&#x60F3;&#x5982;&#x4E0B;&#xFF1A;<br>1.&#x904D;&#x5386;&#x5E8F;&#x5217;&#xFF0C;&#x9009;&#x51FA;&#x5F53;&#x524D;&#x5E8F;&#x5217;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x548C;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4EA4;&#x6362;&#x3002;
2.&#x4E0D;&#x5305;&#x542B;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x5E8F;&#x5217;&#x91CD;&#x590D;&#x6B65;&#x9AA4;1&#x3002;<br>3.&#x6BCF;&#x6B21;&#x6570;&#x5B57;&#x5C11;&#x4E00;&#x4E2A;&#xFF0C;&#x76F4;&#x5230;&#x6570;&#x5B57;&#x5269;&#x4E00;&#x4E2A;&#x4E3A;&#x6B62;&#x3002;  </p>
<p>&#x590D;&#x6742;&#x5EA6;&#xFF1A;&#x8FD9;&#x4E2A;&#x548C;&#x5192;&#x6CE1;&#x7B97;&#x6CD5;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E00;&#x6837;&#xFF0C;&#x4E5F;&#x662F;O(n^2)&#x3002; </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/selection-sort.png" alt=""></p>
<h2 id="&#x4E94;&#x3001;&#x63D2;&#x5165;&#x6392;&#x5E8F;">&#x4E94;&#x3001;&#x63D2;&#x5165;&#x6392;&#x5E8F;</h2>
<p>&#x63D2;&#x5165;&#x6392;&#x5E8F;&#x548C;&#x5192;&#x6CE1;&#x4E5F;&#x5F88;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x5192;&#x6CE1;&#x6BCF;&#x6B21;&#x90FD;&#x662F;&#x5728;&#x4E71;&#x5E8F;&#x5E8F;&#x5217;&#x5185;&#x904D;&#x5386;&#xFF0C;&#x800C;&#x63D2;&#x5165;&#x6392;&#x5E8F;&#x5219;&#x662F;&#x5728;&#x5DF2;&#x6392;&#x5E8F;&#x7684;&#x5E8F;&#x5217;&#x4E0A;&#x626B;&#x63CF;&#x3002;  </p>
<p>&#x5177;&#x4F53;&#x601D;&#x60F3;&#x5982;&#x4E0B;&#xFF1A;<br>1.&#x53D6;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x8BA4;&#x4E3A;&#x5DF2;&#x7ECF;&#x6392;&#x5E8F;&#x3002;<br>2.&#x53D6;&#x4E0B;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x5728;&#x5DF2;&#x7ECF;&#x6392;&#x5E8F;&#x7684;&#x5E8F;&#x5217;&#x4E2D;&#x4ECE;&#x540E;&#x5411;&#x524D;&#x626B;&#x63CF;&#x3002;<br>3.&#x5982;&#x679C;&#x8BE5;&#x5143;&#x7D20;&#x5927;&#x4E8E;&#x65B0;&#x5143;&#x7D20;&#xFF0C;&#x5C06;&#x8BE5;&#x5143;&#x7D20;&#x79FB;&#x5230;&#x4E0B;&#x4E00;&#x4F4D;&#x3002;<br>4.&#x91CD;&#x590D;&#x6B65;&#x9AA4;3&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x5DF2;&#x6392;&#x5E8F;&#x7684;&#x5143;&#x7D20;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;&#x65B0;&#x5143;&#x7D20;&#x3002;<br>5.&#x5C06;&#x65B0;&#x5143;&#x7D20;&#x63D2;&#x5165;&#x5230;&#x8BE5;&#x5143;&#x7D20;&#x4F4D;&#x7F6E;&#x540E;&#x9762;&#x3002;<br>6.&#x91CD;&#x590D;&#x6B65;&#x9AA4;2~5&#x3002;   </p>
<p>&#x590D;&#x6742;&#x5EA6;&#xFF1A;&#x4F9D;&#x65E7;&#x662F;O(n^2)&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/insertion-sort.png" alt=""></p>
<h2 id="&#x516D;&#x3001;&#x5F52;&#x5E76;&#x6392;&#x5E8F;">&#x516D;&#x3001;&#x5F52;&#x5E76;&#x6392;&#x5E8F;</h2>
<p>&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x662F;&#x5206;&#x6CBB;&#x6CD5;&#x7684;&#x4E00;&#x4E2A;&#x7ECF;&#x5178;&#x5E94;&#x7528;&#x3002;<br>&#x57FA;&#x672C;&#x601D;&#x60F3;&#x662F;&#xFF1A;
1.&#x5C06;&#x5E8F;&#x5217;&#x5E73;&#x5747;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x5B50;&#x5E8F;&#x5217;&#x3002;<br>2.&#x5206;&#x522B;&#x9012;&#x5F52;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x4F7F;&#x5F97;&#x5B50;&#x5E8F;&#x5217;&#x6709;&#x5E8F;&#x3002;
3.&#x5408;&#x5E76;&#x4E24;&#x4E2A;&#x6709;&#x5E8F;&#x7684;&#x5B50;&#x5E8F;&#x5217;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/merge-sort.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x590D;&#x6742;&#x5EA6;&#x6D89;&#x53CA;&#x5230;&#x9012;&#x5F52;&#x8BA1;&#x7B97;&#xFF0C;&#x516C;&#x5F0F;&#x662F; f(n) = 2 * f(n/2) + n&#xFF0C;&#x4E00;&#x822C;&#x4F7F;&#x7528;&#x9012;&#x5F52;&#x6811;&#x6765;&#x8BA1;&#x7B97;&#x3002;<br>&#x5BF9;&#x4E8E;f(n)&#x7684;&#x590D;&#x6742;&#x5EA6;&#xFF0C;&#x6709;&#x5408;&#x5E76;&#x7684;O(n)&#x548C;&#x4E24;&#x4E2A;&#x5B50;&#x6570;&#x7EC4; f(n/2) &#x5F97;&#x5230;&#x3002;<br>&#x800C;&#x6BCF;&#x4E2A;f(n/2) &#x4E5F;&#x90FD;&#x662F;&#x6709;&#x5408;&#x5E76;&#x7684;O(n/2) &#x548C;&#x4E24;&#x4E2A;&#x5B50;&#x5B50;&#x6570;&#x7EC4; f(n/2) &#x5F97;&#x5230;&#x3002; 
&#x5168;&#x90E8;&#x5C55;&#x5F00;&#x540E;&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x603B;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x662F;&#x5404;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5408;&#x5E76;&#x590D;&#x6742;&#x5EA6;&#x4E4B;&#x548C;&#xFF0C;&#x6070;&#x597D;&#x6BCF;&#x5C42;&#x7684;&#x548C;&#x662F; O(n)&#xFF0C;&#x5171;&#x6709; log(n) &#x5C42;&#xFF0C;&#x6240;&#x4EE5;&#x603B;&#x590D;&#x6742;&#x5EA6;&#x662F; O(n log(n))&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/merge-sort-alg.png" alt=""></p>
<h2 id="&#x4E03;&#x3001;&#x5FEB;&#x901F;&#x6392;&#x5E8F;">&#x4E03;&#x3001;&#x5FEB;&#x901F;&#x6392;&#x5E8F;</h2>
<p>&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x662F;&#x5148;&#x5C06;&#x5E8F;&#x5217;&#x4ECE;&#x4E2D;&#x95F4;&#x5206;&#x4E24;&#x90E8;&#x5206;&#x5206;&#x522B;&#x9012;&#x5F52;&#x6392;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x5408;&#x5E76;&#x5728;&#x4E00;&#x8D77;&#x3002;<br>&#x800C;&#x5FEB;&#x901F;&#x6392;&#x5E8F;&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x9012;&#x5F52;&#x6392;&#x5E8F;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x3002;  </p>
<p>&#x57FA;&#x672C;&#x601D;&#x60F3;&#xFF1A;<br>1.&#x4ECE;&#x5E8F;&#x5217;&#x4E2D;&#x968F;&#x673A;&#x8DF3;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x3002;
2.&#x91CD;&#x65B0;&#x6392;&#x5217;&#x5E8F;&#x5217;&#xFF0C;&#x5C06;&#x5E8F;&#x5217;&#x6309;&#x7167;&#x6311;&#x7684;&#x6570;&#x5B57;&#x5206;&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x524D;&#x4E00;&#x90E8;&#x5206;&#x5C0F;&#x4E8E;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x540E;&#x4E00;&#x90E8;&#x5206;&#x5927;&#x4E8E;&#x7B49;&#x4E8E;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x3002;
3.&#x6B65;&#x9AA4;2&#x5F97;&#x5230;&#x7684;&#x4E24;&#x4E2A;&#x5B50;&#x5E8F;&#x5217;&#x5206;&#x522B;&#x6309;&#x7167;&#x6B65;&#x9AA4;&#x4E00;&#x548C;&#x6B65;&#x9AA4;&#x4E8C;&#x9012;&#x5F52;&#x8FD0;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x6570;&#x5B57;&#x4E3A;&#x4E00;&#x4E2A;&#x3002;  </p>
<p>&#x5FEB;&#x6392;&#x548C;&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x7C7B;&#x4F3C;&#xFF0C;&#x90FD;&#x662F;&#x5206;&#x800C;&#x6CBB;&#x4E4B;&#xFF0C;&#x6240;&#x4EE5;&#x590D;&#x6742;&#x5EA6;&#x90FD;&#x662F;O(n log(n))&#xFF0C;&#x4E0D;&#x8FC7;&#x5BF9;&#x4E8E;&#x5FEB;&#x6392;&#xFF0C;&#x5728;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x4F1A;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x5EA6;&#x662F;O(n^2)&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/quick-sort.png" alt="">  </p>
<h2 id="&#x516B;&#x3001;&#x5806;&#x6392;&#x5E8F;">&#x516B;&#x3001;&#x5806;&#x6392;&#x5E8F;</h2>
<p>&#x5806;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x6709;&#x7528;&#x7684;&#x6811;&#x5F62;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;<br>&#x4EE5;&#x6700;&#x5927;&#x5806;&#x4E3A;&#x4F8B;&#xFF0C;&#x5806;&#x7684;&#x7236;&#x8282;&#x70B9;&#x5FC5;&#x987B;&#x5927;&#x4E8E;&#x4E24;&#x4E2A;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x9012;&#x5F52;&#x63A8;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x5806;&#x7684;&#x9876;&#x70B9;&#x5C31;&#x662F;&#x6700;&#x5927;&#x503C;&#x3002;
&#x7531;&#x4E8E;&#x5806;&#x662F;&#x6807;&#x51C6;&#x7684;&#x6811;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x8282;&#x70B9;&#x7684;&#x64CD;&#x4F5C;&#x590D;&#x6742;&#x5EA6;&#x6700;&#x574F;&#x60C5;&#x51B5;&#x662F;O(log(n))&#xFF0C;&#x6211;&#x4EEC;&#x4F9D;&#x6B21;&#x4ECE;&#x9876;&#x70B9;&#x53D6;&#x51FA;&#x6700;&#x5927;&#x503C;&#x5373;&#x53EF;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6709;&#x5E8F;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x6700;&#x7EC8;&#x590D;&#x6742;&#x5EA6;&#x662F;O(n log(n))&#x3002;<br>&#x800C;&#x6784;&#x9020;&#x5806;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x63D2;&#x5165;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6784;&#x9020;&#x5806;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x4E5F;&#x662F;O(n log(n))&#x3002;  </p>
<p>&#x6392;&#x5E8F;&#x7684;&#x5177;&#x4F53;&#x601D;&#x60F3;&#x5982;&#x4E0B;&#xFF1A;
1.&#x4F9D;&#x6B21;&#x6784;&#x5EFA;&#x6700;&#x5927;&#x5806;&#x3002;<br>2.&#x5C06;&#x5806;&#x9876;&#x5143;&#x7D20;&#x4E0E;&#x5806;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x4EA4;&#x6362;&#xFF0C;&#x5806;&#x7684;&#x5927;&#x5C0F;&#x51CF;&#x4E00;&#x3001;&#x7EF4;&#x62A4;&#x5806;&#x6EE1;&#x8DB3;&#x5806;&#x7684;&#x7279;&#x6027;&#x3002;
3.&#x91CD;&#x590D;&#x6B65;&#x9AA4;&#x4E8C;&#xFF0C;&#x76F4;&#x5230;&#x5806;&#x53EA;&#x5269;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/down-heapify.png" alt=""><br><img src="http://res.tiankonguse.com/images/2018/09/heap-sort.png" alt="">    </p>
<h2 id="&#x4E5D;&#x3001;&#x5176;&#x4ED6;&#x6392;&#x5E8F;">&#x4E5D;&#x3001;&#x5176;&#x4ED6;&#x6392;&#x5E8F;</h2>
<p>&#x6392;&#x5E8F;&#x7684;&#x65B9;&#x6CD5;&#x5F88;&#x591A;&#xFF0C;&#x5982;&#x8BA1;&#x6570;&#x6392;&#x5E8F;&#x3001;&#x6876;&#x6392;&#x5E8F;&#x3001;&#x57FA;&#x6570;&#x6392;&#x5E8F;&#x3001;&#x5E0C;&#x5C14;&#x6392;&#x5E8F;&#x3002;<br>&#x53E6;&#x5916;&#x6392;&#x5E8F;&#x8FD8;&#x6D89;&#x53CA;&#x5230;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x3001;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x3001;&#x662F;&#x5426;&#x662F;&#x7A33;&#x5B9A;&#x6392;&#x5E8F;&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x4ECB;&#x7ECD;&#x4E86;&#x3002;<br>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x60F3;&#x60F3;&#x8BE5;&#x5206;&#x4EAB;&#x5565;&#x7B97;&#x6CD5;&#xFF0C;&#x592A;&#x57FA;&#x7840;&#x4E86;&#x4F1A;&#x611F;&#x89C9;&#x592A;&#x7B80;&#x5355;&#xFF0C;&#x592A;&#x96BE;&#x4E86;&#x6587;&#x5B57;&#x53C8;&#x4E0D;&#x597D;&#x8BB2;&#xFF0C;&#x786E;&#x5B9E;&#x5F88;&#x7EA0;&#x7ED3;&#x3002;  </p>
<hr>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="alg-problem-type-division.html" class="navigation navigation-prev " aria-label="Previous page: 2. 了解套路长啥样">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="binary-search.html" class="navigation navigation-next " aria-label="Next page: 4. 二分查找">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3. 排序算法","level":"1.4","depth":1,"next":{"title":"4. 二分查找","level":"1.5","depth":1,"path":"binary-search.md","ref":"binary-search.md","articles":[]},"previous":{"title":"2. 了解套路长啥样","level":"1.3","depth":1,"path":"alg-problem-type-division.md","ref":"alg-problem-type-division.md","articles":[]},"dir":"ltr"},"config":{"plugins":["search","highlight","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"highlight":{},"livereload":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"language ":"zh-hans","theme":"default","author":"tiankonguse","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"从零开始学算法","gitbook":"*","description":"这是一本介绍算法的书籍。虽然名字是从零开始学算法，但是需要你有一定的计算机基础才行。","theme-default":{"showLevel":true}},"file":{"path":"base-sort.md","mtime":"2019-07-11T17:47:31.291Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-07-11T17:56:11.220Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

