
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>5. 万能数组 · 从零开始学算法</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="tiankonguse">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="link.html" />
    
    
    <link rel="prev" href="binary-search.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    0. 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="alg-base.html">
            
                <a href="alg-base.html">
            
                    
                    1. 认识算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="alg-problem-type-division.html">
            
                <a href="alg-problem-type-division.html">
            
                    
                    2. 了解套路长啥样
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="base-sort.html">
            
                <a href="base-sort.html">
            
                    
                    3. 排序算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="binary-search.html">
            
                <a href="binary-search.html">
            
                    
                    4. 二分查找
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="full-array.html">
            
                <a href="full-array.html">
            
                    
                    5. 万能数组
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="link.html">
            
                <a href="link.html">
            
                    
                    6. 链表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="skip-list.html">
            
                <a href="skip-list.html">
            
                    
                    7. 跳表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="summon-dragon.html">
            
                <a href="summon-dragon.html">
            
                    
                    8. 召唤神龙
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="last.md">
            
                <span>
            
                    
                    9. 后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >5. 万能数组</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x96F6;&#x3001;&#x80CC;&#x666F;">&#x96F6;&#x3001;&#x80CC;&#x666F;</h2>
<p>&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x6211;&#x662F;tiankonguse&#x3002;<br>&#x7531;&#x4E8E;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x7ECF;&#x5E38;&#x6709;&#x4EBA;&#x60F3;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x4F46;&#x4E4B;&#x524D;&#x53C8;&#x6CA1;&#x6709;&#x76F8;&#x5173;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x4F55;&#x505A;&#x8D77;&#x3002;
&#x6211;&#x601D;&#x8003;&#x4E86;&#x8BB8;&#x4E45;&#xFF0C;&#x8BA1;&#x5212;&#x5199;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#x6765;&#x5206;&#x4EAB;&#x5982;&#x4F55;&#x5165;&#x95E8;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x3002;  </p>
<p>&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x5206;&#x4EAB;&#x4E86;&#x300A;<a href="https://mp.weixin.qq.com/s/2CyGYZ5SFs-cLBHkxAhdyg" target="_blank">&#x8BA4;&#x8BC6;&#x7B97;&#x6CD5;</a>&#x300B;&#x3001;&#x300A;<a href="https://mp.weixin.qq.com/s/OvX3H9_JmzjPA091ZqUegQ" target="_blank">&#x4E86;&#x89E3;&#x5957;&#x8DEF;&#x957F;&#x5565;&#x6837;</a>&#x300B;&#x3001;&#x300A;<a href="https://mp.weixin.qq.com/s/MSoXEzDSyxf3gVAt-2D1bw" target="_blank">&#x6392;&#x5E8F;&#x7B97;&#x6CD5;</a>&#x300B;&#x3001;&#x300A;<a href="https://mp.weixin.qq.com/s/UQ7wU7qHd-YI4P4iCYAa3g" target="_blank">&#x4E8C;&#x5206;&#x67E5;&#x627E;</a>&#x300B;&#xFF0C;&#x8FD9;&#x662F;&#x7B2C;&#x4E94;&#x7BC7;&#x300A;&#x4E07;&#x80FD;&#x6570;&#x7EC4;&#x300B;&#x3002;  </p>
<p>&#x8003;&#x8651;&#x5230;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x662F;&#x79D1;&#x73ED;&#x51FA;&#x8EAB;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x5F53;&#x521D;&#x6CA1;&#x597D;&#x597D;&#x5B66;&#x4E60;&#xFF0C;&#x5F88;&#x591A;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x90FD;&#x5FD8;&#x8BB0;&#x4E86;&#x3002;<br>&#x8FD8;&#x6709;&#x4E0A;&#x6B21;&#x8BF4;&#x7684;&#x4EA4;&#x63A5;&#x7ED9;&#x6211;&#x7684;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x5173;&#x952E;&#x903B;&#x8F91;&#x5C31;&#x662F;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;O(n)&#x590D;&#x6742;&#x5EA6;&#x7684;&#x64CD;&#x4F5C;&#x5230;&#x5904;&#x90FD;&#x662F;&#xFF0C;&#x771F;&#x5B9E;&#x60E8;&#x4E0D;&#x5FCD;&#x7779;&#x3002;<br>&#x6240;&#x4EE5;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x6765;&#x7ED9;&#x5927;&#x5BB6;&#x666E;&#x53CA;&#x4E0B;&#x6570;&#x7EC4;&#x4E0A;&#x7684;&#x77E5;&#x8BC6;&#x70B9;&#xFF0C;&#x5927;&#x5BB6;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x5EA6;&#x9AD8;&#x7684;&#x64CD;&#x4F5C;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#xFF0C;&#x4E0D;&#x7136;&#x540E;&#x9762;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x74F6;&#x9888;&#x70B9;&#x3002;<br>&#x4EE5;&#x540E;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x5373;&#x4F7F;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x6027;&#x80FD;&#x7FFB;&#x4E86;&#x51E0;&#x500D;&#xFF0C;&#x4E5F;&#x6CA1;&#x4EC0;&#x4E48;&#x597D;&#x70AB;&#x8000;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x672C;&#x6765;&#x5C31;&#x662F;&#x57FA;&#x7840;&#xFF0C;&#x6700;&#x521D;&#x5B9E;&#x73B0;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x3002;  </p>
<h2 id="&#x4E00;&#x3001;&#x57FA;&#x7840;&#x77E5;&#x8BC6;">&#x4E00;&#x3001;&#x57FA;&#x7840;&#x77E5;&#x8BC6;</h2>
<p>C&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x6570;&#x7EC4;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x5F53;&#x505A;&#x4E00;&#x4E2A;&#x5B9A;&#x957F;&#x7684;&#x8FDE;&#x7EED;&#x7684;&#x7A7A;&#x95F4;&#x3002;<br>&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x6807;&#x5728;O(1)&#x7684;&#x65F6;&#x95F4;&#x4E0A;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;&#x6216;&#x8005;&#x4FEE;&#x6539;&#x5BF9;&#x5E94;&#x4F4D;&#x7F6E;&#x7684;&#x503C;&#x3002;<br>&#x6240;&#x4EE5;&#x6570;&#x7EC4;&#x5728;&#x5F88;&#x591A;&#x65F6;&#x5019;&#x662F;&#x4E00;&#x79CD;&#x6700;&#x5E38;&#x89C1;&#x9AD8;&#x6548;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x59D1;&#x4E14;&#x7B97;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF09;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/array-base.png" alt="">  </p>
<p>&#x4F46;&#x662F;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x4F1A;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x3002;<br>&#x6BD4;&#x5982;&#x6570;&#x7EC4;&#x7684;&#x7A7A;&#x95F4;&#x4E0D;&#x7BA1;&#x6211;&#x4EEC;&#x6709;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#xFF0C;&#x957F;&#x5EA6;&#x90FD;&#x662F;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x7528;&#x4E86;&#x591A;&#x5C11;&#x3002;<br>&#x5982;&#x679C;&#x6570;&#x7EC4;&#x6EE1;&#x4E86;&#xFF0C;&#x60F3;&#x7EE7;&#x7EED;&#x52A0;&#x5143;&#x7D20;&#xFF0C;&#x5C31;&#x4F1A;&#x6570;&#x7EC4;&#x8D8A;&#x754C;&#x3002;<br>&#x5982;&#x679C;&#x6570;&#x7EC4;&#x524D;&#x9762;&#x60F3;&#x5220;&#x9664;&#xFF0C;&#x6D89;&#x53CA;&#x5230;&#x540E;&#x9762;&#x7684;&#x5143;&#x7D20;copy&#x5230;&#x524D;&#x9762;&#xFF0C;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x662F;O(n)&#x3002;  </p>
<p>&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5BF9;&#x6570;&#x7EC4;&#x8FDB;&#x884C;&#x4E00;&#x4E2A;&#x5C01;&#x88C5;&#xFF0C;&#x540D;&#x5B57;&#x5C31;&#x53EB;&#x505A;&#x4E07;&#x80FD;&#x6570;&#x7EC4;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4EFB;&#x4F55;&#x6211;&#x4EEC;&#x60F3;&#x64CD;&#x4F5C;&#x7684;&#x4E8B;&#x60C5;&#x3002;<br>&#x4E3A;&#x4E86;&#x4EE3;&#x7801;&#x7B80;&#x5355;&#x70B9;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x4F7F;&#x7528;&#x6A21;&#x677F;&#xFF0C;&#x76F4;&#x63A5;&#x4EE5;&#x6574;&#x6570;&#x4E3A;&#x4F8B;&#x3002;  </p>
<h2 id="&#x4E8C;&#x3001;&#x81EA;&#x52A8;&#x6269;&#x5C55;&#x6570;&#x7EC4;">&#x4E8C;&#x3001;&#x81EA;&#x52A8;&#x6269;&#x5C55;&#x6570;&#x7EC4;</h2>
<p>&#x4F7F;&#x7528;&#x6570;&#x636E;&#x65F6;&#x7ECF;&#x5E38;&#x4F1A;&#x53D1;&#x73B0;&#x7A7A;&#x95F4;&#x4E0D;&#x591F;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x6269;&#x5927;&#x7A7A;&#x95F4;&#x5C31;&#x597D;&#x4E86;&#x3002;<br>&#x81EA;&#x52A8;&#x6269;&#x5C55;&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x662F;&#x8FFD;&#x52A0;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5148;&#x5224;&#x65AD;&#x7A7A;&#x95F4;&#x662F;&#x4E0D;&#x662F;&#x7528;&#x5B8C;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x5B8C;&#x4E86;&#xFF0C;&#x7533;&#x8BF7;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x65E7;&#x6570;&#x636E;copy&#x8FC7;&#x53BB;&#xFF0C;&#x65E7;&#x5185;&#x5B58;&#x91CA;&#x653E;&#xFF0C;&#x65B0;&#x6570;&#x636E;&#x8D4B;&#x503C;&#x5373;&#x53EF;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/full-array.png" alt="">  </p>
<h2 id="&#x4E09;&#x3001;&#x6808;">&#x4E09;&#x3001;&#x6808;</h2>
<p>&#x6808;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x5E38;&#x7528;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x7279;&#x70B9;&#x5C31;&#x662F;&#x540E;&#x8FDB;&#x5148;&#x51FA;&#x3002;<br>&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x4F60;&#x4EEC;&#x4E00;&#x6392;&#x8F66;&#x5F00;&#x8FDB;&#x6B7B;&#x80E1;&#x540C;&#x4E86;&#xFF0C;&#x6700;&#x5148;&#x8FDB;&#x53BB;&#x7684;&#x5728;&#x6700;&#x91CC;&#x9762;&#xFF0C;&#x6700;&#x540E;&#x8FDB;&#x53BB;&#x7684;&#x5728;&#x6700;&#x5916;&#x9762;&#x3002;<br>&#x90A3;&#x5927;&#x5BB6;&#x60F3;&#x51FA;&#x6765;&#xFF0C;&#x80AF;&#x5B9A;&#x662F;&#x6700;&#x5916;&#x9762;&#x7684;&#x5148;&#x51FA;&#x6765;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6700;&#x540E;&#x8FDB;&#x53BB;&#x7684;&#x5148;&#x51FA;&#x6765;&#xFF08;&#x540E;&#x8FDB;&#x5148;&#x51FA;&#xFF09;&#x3002;  </p>
<p>&#x6808;&#x7684;&#x4F7F;&#x7528;&#x573A;&#x666F;&#x6709;&#xFF1A;&#x5E8F;&#x5217;&#x53CD;&#x9009;&#x3001;&#x9006;&#x5E8F;&#x8F93;&#x51FA;&#x3001;&#x62EC;&#x53F7;&#x5339;&#x914D;&#x3001;DFS&#x7B49;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/full-stack.png" alt="">  </p>
<h2 id="&#x56DB;&#x3001;&#x961F;&#x5217;">&#x56DB;&#x3001;&#x961F;&#x5217;</h2>
<p>&#x961F;&#x5217;&#x662F;&#x4E00;&#x79CD;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;<br>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#x6392;&#x961F;&#x5403;&#x996D;&#xFF0C;&#x5148;&#x6253;&#x996D;&#x7684;&#x80AF;&#x5B9A;&#x662F;&#x961F;&#x9996;&#x7684;&#x90A3;&#x4E2A;&#x4EBA;&#x3002;  </p>
<p>&#x7531;&#x4E8E;&#x961F;&#x5217;&#x6D89;&#x53CA;&#x5230;&#x5220;&#x9664;&#x6570;&#x7EC4;&#x524D;&#x9762;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x6807;&#x8BB0;&#x6765;&#x6807;&#x8BB0;&#x524D;&#x9762;&#x5220;&#x9664;&#x4E86;&#x591A;&#x5C11;&#x4E2A;&#x5143;&#x7D20;&#x3002;<br>&#x5BF9;&#x4E8E;&#x5185;&#x5B58;&#x6269;&#x5C55;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x4ECE;&#x5934;&#x5BF9;&#x9F50;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x91CC;&#x6682;&#x65F6;&#x4E0D;&#x5904;&#x7406;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/full-queue.png" alt="">  </p>
<h2 id="&#x4E94;&#x3001;&#x53CC;&#x5411;&#x961F;&#x5217;">&#x4E94;&#x3001;&#x53CC;&#x5411;&#x961F;&#x5217;</h2>
<p>&#x6808;&#x5927;&#x5BB6;&#x90FD;&#x542C;&#x8FC7;&#xFF0C;&#x961F;&#x5217;&#x5927;&#x5BB6;&#x4E5F;&#x90FD;&#x542C;&#x8FC7;&#xFF0C;&#x90A3;&#x53CC;&#x5411;&#x961F;&#x5217;&#x542C;&#x8FC7;&#x7684;&#x4EBA;&#x5C31;&#x4E0D;&#x591A;&#x4E86;&#x5427;&#x3002;<br>&#x53CC;&#x5411;&#x961F;&#x5217;&#xFF0C;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5C31;&#x662F;&#x4E24;&#x8FB9;&#x90FD;&#x53EF;&#x4EE5;&#x8FDB;&#x4E5F;&#x90FD;&#x53EF;&#x4EE5;&#x51FA;&#x7684;&#x961F;&#x5217;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6808;&#x548C;&#x961F;&#x5217;&#x7684;&#x5408;&#x4F53;&#x4E86;&#x3002;  </p>
<p>&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x961F;&#x9996;&#x4E5F;&#x53EF;&#x4EE5;&#x63D2;&#x5165;&#x6570;&#x636E;&#x4E86;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x524D;&#x9762;&#x7684;&#x7A7A;&#x95F4;&#x7528;&#x5B8C;&#x4E0D;&#x591F;&#x7528;&#x4E86;&#x3002;<br>&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x5230;&#x4E86;&#x4E0D;&#x5F97;&#x4E0D;&#x9762;&#x5BF9;&#x961F;&#x9996;&#x7A7A;&#x95F4;&#x7684;&#x95EE;&#x9898;&#x4E86;&#xFF0C;&#x4E0B;&#x4E00;&#x5C0F;&#x8282;&#x5206;&#x4EAB;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5B9E;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/double-queue.png" alt="">  </p>
<h2 id="&#x516D;&#x3001;&#x5FAA;&#x73AF;&#x961F;&#x5217;">&#x516D;&#x3001;&#x5FAA;&#x73AF;&#x961F;&#x5217;</h2>
<p>&#x5728;&#x961F;&#x5217;&#x548C;&#x53CC;&#x5411;&#x961F;&#x5217;&#x5C0F;&#x8282;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x3002;<br>&#x95EE;&#x9898;1&#xFF1A;&#x961F;&#x5217;&#x7684;&#x961F;&#x5C3E;&#x6CA1;&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x961F;&#x9996;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x7A7A;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x6CA1;&#x529E;&#x6CD5;&#x7528;&#x8D77;&#x6765;&#xFF0C;&#x53EA;&#x80FD;&#x76F4;&#x63A5;&#x6269;&#x5927;&#x5185;&#x5B58;&#x3002;<br>&#x95EE;&#x9898;2&#xFF1A;&#x53CC;&#x5411;&#x961F;&#x5217;&#x7684;&#x961F;&#x9996;&#x6CA1;&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x961F;&#x5C3E;&#x53EF;&#x80FD;&#x6709;&#x7A7A;&#x95F4;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x6CA1;&#x7528;&#x8D77;&#x6765;&#xFF0C;&#x4E0D;&#x4F46;&#x9700;&#x8981;&#x6269;&#x5927;&#x5185;&#x5B58;&#xFF0C;&#x8FD8;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x504F;&#x79FB;&#xFF0C;&#x597D;&#x7ED9;&#x961F;&#x9996;&#x9884;&#x7559;&#x4E00;&#x4E9B;&#x4F4D;&#x7F6E;&#x6765;&#x3002;  </p>
<p>&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x8FD8;&#x6709;&#x7A7A;&#x95F4;&#x65F6;&#xFF0C;&#x5C3D;&#x91CF;&#x5229;&#x7528;&#x5DF2;&#x6709;&#x7684;&#x7A7A;&#x95F4;&#x3002;<br>&#x6BD4;&#x5982;&#x961F;&#x5C3E;&#x7684;&#x7A7A;&#x95F4;&#x7528;&#x5B8C;&#x4E86;&#xFF0C;&#x961F;&#x9996;&#x8FD8;&#x6709;&#xFF0C;&#x90A3;&#x5165;&#x961F;&#x5C31;&#x653E;&#x5728;&#x961F;&#x9996;&#x90A3;&#x4E00;&#x5934;&#x3002;<br>&#x76F4;&#x5230;&#x786E;&#x5B9E;&#x6CA1;&#x6709;&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x624D;&#x53BB;&#x6269;&#x5C55;&#x7A7A;&#x95F4;&#x3002;    </p>
<p>&#x53CC;&#x5411;&#x5FAA;&#x73AF;&#x961F;&#x5217;&#x4E0E;&#x5FAA;&#x73AF;&#x961F;&#x5217;&#x7684;&#x601D;&#x60F3;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x4EE5;&#x5FAA;&#x73AF;&#x961F;&#x5217;&#x4E3A;&#x4F8B;&#x6765;&#x770B;&#x770B;&#x5B9E;&#x73B0;&#x5427;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/loop-queue.png" alt="">  </p>
<h2 id="&#x4E03;&#x3001;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;">&#x4E03;&#x3001;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;</h2>
<p>&#x4E0A;&#x9762;&#x5BF9;&#x4E8E;&#x6570;&#x7EC4;&#x53EA;&#x8FDB;&#x884C;&#x4E86;&#x7B80;&#x5355;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5373;&#x9996;&#x5C3E;&#x589E;&#x5220;&#x6570;&#x636E;&#x3002;<br>&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x662F;&#x53EF;&#x80FD;&#x5728;&#x4E2D;&#x95F4;&#x63D2;&#x5165;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x5220;&#x9664;&#x4E2D;&#x95F4;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x4E0B;&#x6807;&#x5B9A;&#x4F4D;&#x3002;<br>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5982;&#x679C;&#x7C97;&#x66B4;&#x7684;&#x5B9E;&#x73B0;&#x7684;&#x8BDD;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x590D;&#x6742;&#x5EA6;&#x662F;O(n)&#x7684;&#x3002;  </p>
<p>&#x6BD4;&#x5982;&#x5220;&#x9664;&#x6570;&#x7EC4;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x90A3;&#x4E48;&#x6570;&#x7EC4;&#x540E;&#x9762;&#x6240;&#x6709;&#x7684;&#x5143;&#x7D20;&#x90FD;&#x9700;&#x8981;&#x524D;&#x79FB;&#x4E00;&#x4E0B;&#xFF08;&#x901A;&#x8FC7;&#x5FAA;&#x73AF;&#x961F;&#x5217;&#x53EF;&#x4EE5;&#x4E0D;&#x79FB;&#x52A8;&#xFF09;&#x3002;<br>&#x800C;&#x5728;&#x4E2D;&#x95F4;&#x63D2;&#x5165;&#x6216;&#x5220;&#x9664;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#xFF0C;&#x64CD;&#x4F5C;&#x4F4D;&#x7F6E;&#x540E;&#x9762;&#x7684;&#x7A7A;&#x95F4;&#x4F9D;&#x65E7;&#x9700;&#x8981;&#x79FB;&#x52A8;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5FAA;&#x73AF;&#x961F;&#x5217;&#x5C31;&#x6CA1;&#x8F99;&#x4E86;&#x3002;<br>&#x9762;&#x5BF9;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x5462;&#xFF1F;<br>&#x540E;&#x7EED;&#x7684;&#x6587;&#x7AE0;&#x6162;&#x6162;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x6765;&#x3002;  </p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="binary-search.html" class="navigation navigation-prev " aria-label="Previous page: 4. 二分查找">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="link.html" class="navigation navigation-next " aria-label="Next page: 6. 链表">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"5. 万能数组","level":"1.6","depth":1,"next":{"title":"6. 链表","level":"1.7","depth":1,"path":"link.md","ref":"link.md","articles":[]},"previous":{"title":"4. 二分查找","level":"1.5","depth":1,"path":"binary-search.md","ref":"binary-search.md","articles":[]},"dir":"ltr"},"config":{"plugins":["search","highlight","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"highlight":{},"livereload":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"language ":"zh-hans","theme":"default","author":"tiankonguse","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"从零开始学算法","gitbook":"*","description":"这是一本介绍算法的书籍。虽然名字是从零开始学算法，但是需要你有一定的计算机基础才行。","theme-default":{"showLevel":true}},"file":{"path":"full-array.md","mtime":"2019-07-11T17:53:52.437Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-07-11T17:56:11.220Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

