
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>6. 链表 · 从零开始学算法</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="tiankonguse">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="skip-list.html" />
    
    
    <link rel="prev" href="full-array.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    0. 简介
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="alg-base.html">
            
                <a href="alg-base.html">
            
                    
                    1. 认识算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="alg-problem-type-division.html">
            
                <a href="alg-problem-type-division.html">
            
                    
                    2. 了解套路长啥样
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="base-sort.html">
            
                <a href="base-sort.html">
            
                    
                    3. 排序算法
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="binary-search.html">
            
                <a href="binary-search.html">
            
                    
                    4. 二分查找
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="full-array.html">
            
                <a href="full-array.html">
            
                    
                    5. 万能数组
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="link.html">
            
                <a href="link.html">
            
                    
                    6. 链表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="skip-list.html">
            
                <a href="skip-list.html">
            
                    
                    7. 跳表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="summon-dragon.html">
            
                <a href="summon-dragon.html">
            
                    
                    8. 召唤神龙
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="last.md">
            
                <span>
            
                    
                    9. 后记
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >6. 链表</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="&#x96F6;&#x3001;&#x80CC;&#x666F;">&#x96F6;&#x3001;&#x80CC;&#x666F;</h2>
<p>&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x6211;&#x662F;tiankonguse&#x3002;<br>&#x7531;&#x4E8E;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x7ECF;&#x5E38;&#x6709;&#x4EBA;&#x60F3;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x4F46;&#x4E4B;&#x524D;&#x53C8;&#x6CA1;&#x6709;&#x76F8;&#x5173;&#x7ECF;&#x9A8C;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x4ECE;&#x4F55;&#x505A;&#x8D77;&#x3002;<br>&#x6211;&#x601D;&#x8003;&#x4E86;&#x8BB8;&#x4E45;&#xFF0C;&#x8BA1;&#x5212;&#x5199;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#x6765;&#x5206;&#x4EAB;&#x5982;&#x4F55;&#x5165;&#x95E8;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#x3002;  </p>
<p>&#x4E4B;&#x524D;&#x5DF2;&#x7ECF;&#x5206;&#x4EAB;&#x4E86;&#x300A;<a href="https://mp.weixin.qq.com/s/2CyGYZ5SFs-cLBHkxAhdyg" target="_blank">&#x8BA4;&#x8BC6;&#x7B97;&#x6CD5;</a>&#x300B;&#x3001;&#x300A;<a href="https://mp.weixin.qq.com/s/OvX3H9_JmzjPA091ZqUegQ" target="_blank">&#x4E86;&#x89E3;&#x5957;&#x8DEF;&#x957F;&#x5565;&#x6837;</a>&#x300B;&#x3001;&#x300A;<a href="https://mp.weixin.qq.com/s/MSoXEzDSyxf3gVAt-2D1bw" target="_blank">&#x6392;&#x5E8F;&#x7B97;&#x6CD5;</a>&#x300B;&#x3001;&#x300A;<a href="https://mp.weixin.qq.com/s/UQ7wU7qHd-YI4P4iCYAa3g" target="_blank">&#x4E8C;&#x5206;&#x67E5;&#x627E;</a>&#x300B;&#x3001;&#x300A;<a href="https://mp.weixin.qq.com/s/jjcJFuvDoluOQf26vpA-cQ" target="_blank">&#x4E07;&#x80FD;&#x6570;&#x7EC4;</a>&#x300B;&#xFF0C;&#x8FD9;&#x662F;&#x7B2C;&#x516D;&#x7BC7;&#x300A;&#x94FE;&#x8868;&#x300B;&#x3002;  </p>
<h2 id="&#x4E00;&#x3001;&#x57FA;&#x7840;&#x77E5;&#x8BC6;">&#x4E00;&#x3001;&#x57FA;&#x7840;&#x77E5;&#x8BC6;</h2>
<p>&#x4E0A;&#x7BC7;&#x6587;&#x7AE0;&#x300A;<a href="https://mp.weixin.qq.com/s/jjcJFuvDoluOQf26vpA-cQ" target="_blank">&#x4E07;&#x80FD;&#x6570;&#x7EC4;</a>&#x300B;&#x5728;&#x6700;&#x540E;&#xFF0C;&#x9057;&#x7559;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x6211;&#x4EEC;&#x5728;&#x4E2D;&#x95F4;&#x5220;&#x9664;&#x6216;&#x63D2;&#x5165;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5E73;&#x5747;&#x590D;&#x6742;&#x5EA6;&#x662F;O(n)&#x3002;<br>&#x53E6;&#x5916;&#xFF0C;&#x5728;&#x7A7A;&#x95F4;&#x7528;&#x5B8C;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x65F6;&#xFF0C;&#x4E5F;&#x4F1A;&#x6709;O(n)&#x7684;&#x8C03;&#x6574;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x6709;&#x65F6;&#x5019;&#x4E0D;&#x80FD;&#x63A5;&#x53D7;&#x3002;<br>&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5C31;&#x60F3;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x66F4;&#x5FEB;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x63D2;&#x5165;&#x6216;&#x5220;&#x9664;&#x3002;<br>&#x7B54;&#x6848;&#x81EA;&#x7136;&#x5C31;&#x662F;&#x94FE;&#x8868;&#x4E86;&#x3002;  </p>
<p>&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x4E4B;&#x6240;&#x4EE5;&#x4F1A;&#x9762;&#x4E34;&#x63D2;&#x5165;&#x6216;&#x5220;&#x9664;&#x6027;&#x80FD;&#x4F4E;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x6570;&#x7EC4;&#x7684;&#x7A7A;&#x95F4;&#x662F;&#x5B9A;&#x957F;&#x8FDE;&#x7EED;&#x7684;&#x3002;<br>&#x6240;&#x4EE5;&#x5BF9;&#x5E94;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x81EA;&#x7136;&#x5C31;&#x662F;&#x975E;&#x8FDE;&#x7EED;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x4E86;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5C31;&#x662F;&#x94FE;&#x8868;&#x3002;  </p>
<h2 id="&#x4E8C;&#x3001;&#x5355;&#x5411;&#x94FE;&#x8868;">&#x4E8C;&#x3001;&#x5355;&#x5411;&#x94FE;&#x8868;</h2>
<p>&#x94FE;&#x8868;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x5305;&#x542B;&#x4E24;&#x90E8;&#x5206;&#xFF1A;&#x6570;&#x636E;&#x3001;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x3002;<br>&#x5BF9;&#x4E8E;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x4E00;&#x822C;&#x4F7F;&#x7528;&#x5730;&#x5740;&#x6307;&#x9488;&#x6807;&#x793A;&#xFF0C;&#x540E;&#x9762;&#x4E5F;&#x4F1A;&#x4ECB;&#x7ECD;&#x5176;&#x4ED6;&#x7684;&#x5F62;&#x5F0F;&#x3002;  </p>
<p>&#x6700;&#x5E38;&#x89C1;&#x7684;&#x94FE;&#x8868;&#x5982;&#x4E0B;&#x56FE;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x548C;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E3A;&#x5355;&#x5411;&#x94FE;&#x8868;&#x3002;    </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/link.png" alt="">  </p>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x518D;&#x4E5F;&#x4E0D;&#x6015;&#x7A7A;&#x95F4;&#x4E0D;&#x591F;&#x7528;&#x4E86;&#x3002;<br>&#x770B;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x63D2;&#x5165;&#x590D;&#x6742;&#x5EA6;&#x662F;O(1)&#x7684;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x6700;&#x540E;&#x8FFD;&#x589E;&#x6570;&#x636E;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x662F;O(n)&#x3002;<br>&#x5F53;&#x7136;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x628A;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x50A8;&#x5B58;&#x8D77;&#x6765;&#xFF0C;&#x505A;&#x5230;&#x63D2;&#x5165;O(1)&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x5C31;&#x4E0D;&#x5B9E;&#x73B0;&#x4E86;&#x3002;<br>&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x63D2;&#x5165;&#x6216;&#x5220;&#x9664;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x4E24;&#x4E2A;&#x5173;&#x7CFB;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/link-code.png" alt="">  </p>
<h2 id="&#x4E09;&#x3001;&#x53CC;&#x5411;&#x94FE;&#x8868;">&#x4E09;&#x3001;&#x53CC;&#x5411;&#x94FE;&#x8868;</h2>
<p>&#x4E0A;&#x4E00;&#x5C0F;&#x8282;&#x7684;&#x540D;&#x5B57;&#x662F;&#x5355;&#x5411;&#x94FE;&#x8868;&#xFF0C;&#x81EA;&#x7136;&#x53EF;&#x4EE5;&#x60F3;&#x5230;&#x53CC;&#x5411;&#x94FE;&#x8868;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x50A8;&#x5B58;&#x4E24;&#x4E2A;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/double-link.png" alt="">  </p>
<p>&#x5BF9;&#x4E8E;&#x53CC;&#x5411;&#x94FE;&#x8868;&#xFF0C;&#x6709;&#x4E2A;&#x597D;&#x5904;&#x662F;&#x53EF;&#x4EE5;&#x9006;&#x5411;&#x904D;&#x5386;&#x6570;&#x636E;&#x3002;<br>&#x4E0D;&#x8FC7;&#x589E;&#x52A0;&#x8282;&#x70B9;&#x548C;&#x5220;&#x9664;&#x8282;&#x70B9;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x56DB;&#x4E2A;&#x5173;&#x7CFB;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/double-link-code.png" alt="">  </p>
<h2 id="&#x56DB;&#x3001;&#x5FAA;&#x73AF;&#x94FE;&#x8868;">&#x56DB;&#x3001;&#x5FAA;&#x73AF;&#x94FE;&#x8868;</h2>
<p>&#x5BF9;&#x4E8E;&#x5355;&#x5411;&#x94FE;&#x8868;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x53D1;&#x73B0; &#x94FE;&#x8868;&#x7684;&#x5C3E;&#x90E8;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x6D6A;&#x8D39;&#x4E86;&#x3002;<br>&#x5BF9;&#x4E8E;&#x53CC;&#x5411;&#x94FE;&#x8868;&#xFF0C;&#x5219;&#x662F;&#x8868;&#x5934;&#x7684;ptr&#x4FE1;&#x606F;&#x548C;&#x8868;&#x5C3E;&#x7684;next&#x4FE1;&#x606F;&#x6D6A;&#x8D39;&#x4E86;&#x3002;<br>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x5229;&#x7528;&#x8D77;&#x6765;&#x7684;&#x8BDD;&#xFF0C;&#x8868;&#x5C3E;&#x6307;&#x5411;&#x8868;&#x5934;&#xFF0C;&#x8868;&#x5934;&#x6307;&#x5411;&#x8868;&#x5C3E;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5FAA;&#x73AF;&#x5217;&#x8868;&#x4E86;&#x3002;  </p>
<p>&#x5BF9;&#x4E8E;&#x5FAA;&#x73AF;&#x5217;&#x8868;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5F97;&#x5230;&#x8868;&#x5C3E;&#xFF0C;&#x7136;&#x540E;&#x5FEB;&#x901F;&#x4ECE;&#x961F;&#x5C3E;&#x63D2;&#x5165;&#x6570;&#x636E;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/loop-link.png" alt="">  </p>
<h2 id="&#x4E94;&#x3001;&#x4E0B;&#x6807;&#x94FE;&#x8868;">&#x4E94;&#x3001;&#x4E0B;&#x6807;&#x94FE;&#x8868;</h2>
<p>&#x7B2C;&#x4E00;&#x5C0F;&#x8282;&#x63D0;&#x5230;&#x8FC7;&#xFF0C;&#x94FE;&#x8868;&#x7684;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x5305;&#x542B;&#x4E24;&#x90E8;&#x5206;&#xFF1A;&#x6570;&#x636E;&#x3001;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x3002;<br>&#x800C;&#x5BF9;&#x4E8E;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x5176;&#x5B9E;&#x53EF;&#x4EE5;&#x4E0D;&#x4F7F;&#x7528;&#x6307;&#x9488;&#x7684;&#xFF0C;&#x5728;ACM&#x4E2D;&#x6211;&#x4EEC;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x6570;&#x7EC4;&#x4E0B;&#x6807;&#x6765;&#x6807;&#x8BC6;&#x7684;&#x3002;  </p>
<p>&#x5177;&#x4F53;&#x6765;&#x770B;&#xFF0C;&#x5C31;&#x662F;&#x9884;&#x5148;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6570;&#x7EC4;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x6570;&#x7EC4;&#x7684;&#x4E0B;&#x6807;&#x4EE3;&#x8868;&#x8282;&#x70B9;&#x7684;&#x6307;&#x9488;&#x3002;<br>&#x8FD9;&#x6837;&#x6709;&#x4E2A;&#x597D;&#x5904;&#xFF0C;&#x4EE5;&#x64CD;&#x4F5C;&#x6570;&#x7EC4;&#x7684;&#x5F62;&#x5F0F;&#x624D;&#x505A;&#x94FE;&#x8868;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/index-link.png" alt="">  </p>
<h2 id="&#x516D;&#x3001;&#x5757;&#x72B6;&#x94FE;&#x8868;">&#x516D;&#x3001;&#x5757;&#x72B6;&#x94FE;&#x8868;</h2>
<p>&#x5BF9;&#x4E8E;&#x94FE;&#x8868;&#xFF0C;&#x867D;&#x7136;&#x5728;&#x4E2D;&#x95F4;&#x63D2;&#x5165;&#x5220;&#x9664;&#x6709;&#x5929;&#x7136;&#x4F18;&#x52BF;&#xFF0C;&#x90A3;&#x81EA;&#x7136;&#x4E5F;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x5F31;&#x52BF;&#x3002;<br>&#x804A;&#x8868;&#x4E0B;&#x6807;&#x5B9A;&#x4F4D;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#xFF0C;&#x9700;&#x8981;&#x4ECE;&#x94FE;&#x8868;&#x5934;&#x90E8;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x7684;&#x5FAA;&#x73AF;&#x624D;&#x80FD;&#x627E;&#x5230;&#x6307;&#x5B9A;&#x4E0B;&#x6807;&#x7684;&#x8282;&#x70B9;&#x3002;  </p>
<p>&#x4E94;&#x516D;&#x5E74;&#x524D;&#xFF0C;&#x5728;&#x5927;&#x5B66;ACM&#x6BD4;&#x8D5B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x6298;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5C31;&#x662F;&#x5757;&#x72B6;&#x94FE;&#x8868;&#x3002;<br>&#x8FD9;&#x4E2A;&#x7B97;&#x662F;&#x7ED3;&#x5408;&#x4E86;&#x6570;&#x7EC4;&#x548C;&#x94FE;&#x8868;&#xFF0C;&#x7136;&#x540E;&#x64CD;&#x4F5C;&#x590D;&#x6742;&#x5EA6;&#x4E5F;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x3002;  </p>
<p>&#x5177;&#x4F53;&#x5206;&#x6790;&#xFF0C;&#x6570;&#x7EC4;&#x662F;&#x8FDE;&#x7EED;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;O(1)&#x5B9A;&#x4F4D;&#xFF0C;&#x4F46;&#x662F;&#x63D2;&#x5165;&#x5220;&#x9664;&#x662F;O(n)&#x3002;<br>&#x94FE;&#x8868;&#x662F;&#x975E;&#x8FDE;&#x7EED;&#x5185;&#x5B58;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;O(1)&#x63D2;&#x5165;&#x548C;&#x5220;&#x9664;&#xFF0C;&#x4F46;&#x662F;&#x5B9A;&#x4F4D;&#x8981;O(n)&#x3002;<br>&#x7B97;&#x662F;&#x4E24;&#x79CD;&#x6027;&#x8D28;&#x76F8;&#x53CD;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x7ED3;&#x5408;&#x4E4B;&#x548C;&#x53EF;&#x4EE5;&#x505A;&#x5230;O(sqrt(n))&#x7684;&#x590D;&#x6742;&#x5EA6;&#x3002;<br>&#x800C;ACM&#x6BD4;&#x8D5B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6570;&#x636E;&#x5F80;&#x5F80;&#x662F;&#x5341;&#x4E07;&#x767E;&#x4E07;&#x7EA7;&#x522B;&#xFF0C;&#x5F00;&#x653E;&#x4E00;&#x4E0B;&#x4E0D;&#x8FC7;&#x51E0;&#x767E;&#x51E0;&#x5343;&#xFF0C;&#x4E5F;&#x5C31;&#x53D8;&#x5F97;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4E86;&#x3002;  </p>
<p>&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#x628A;&#x6570;&#x7EC4;&#x5F53;&#x505A;&#x6570;&#x636E;&#x8282;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x6307;&#x9488;&#x8FDE;&#x8D77;&#x6765;&#x5C31;&#x884C;&#x4E86;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/block-link.png" alt="">  </p>
<p>&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x4E2D;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x6570;&#x7EC4;&#x8282;&#x70B9;&#x5F53;&#x524D;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x7684;&#x4E2A;&#x6570;&#x4EE5;&#x53CA;&#x4E0B;&#x4E2A;&#x6570;&#x7EC4;&#x8282;&#x70B9;&#x7684;&#x4F4D;&#x7F6E;&#x5373;&#x53EF;&#x3002;<br>&#x5728;&#x63D2;&#x5165;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5224;&#x65AD;&#x6570;&#x636E;&#x7684;&#x4E2A;&#x6570;&#x662F;&#x5426;&#x8D85;&#x8FC7;&#x6570;&#x7EC4;&#x5927;&#x5C0F;&#xFF0C;&#x8D85;&#x8FC7;&#x4E86;&#x5C31;&#x9700;&#x8981;&#x5206;&#x88C2;&#x6210;&#x4E24;&#x4E2A;&#x6570;&#x7EC4;&#x8282;&#x70B9;&#x3002;<br>&#x5728;&#x5220;&#x9664;&#x6570;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5224;&#x65AD;&#x4E00;&#x4E0B;&#x5F53;&#x524D;&#x6570;&#x7EC4;&#x548C;&#x4E0B;&#x4E2A;&#x6570;&#x7EC4;&#x7684;&#x603B;&#x4E2A;&#x6570;&#x662F;&#x5426;&#x5C0F;&#x4E8E;&#x6307;&#x5B9A;&#x503C;&#xFF0C;&#x5C0F;&#x4E8E;&#x4E86;&#x5C31;&#x5408;&#x5E76;&#x3002;<br>&#x4E0B;&#x6807;&#x5B9A;&#x4F4D;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BCF;&#x6B21;&#x53EF;&#x4EE5;&#x8DF3;&#x8FC7;&#x4E00;&#x4E2A;&#x6570;&#x7EC4;&#xFF0C;&#x6240;&#x4EE5;&#x901F;&#x5EA6;&#x5C31;&#x52A0;&#x5FEB;&#x4E86;&#x3002;  </p>
<p>&#x67E5;&#x627E;&#x65F6;&#x5FAA;&#x73AF;&#x6570;&#x7EC4;&#x627E;&#x5230;&#x8282;&#x70B9;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x4E0B;&#x6807;&#x5177;&#x4F53;&#x5B9A;&#x4F4D;&#x6570;&#x7EC4;&#x5373;&#x53EF;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/block-link-get.png" alt="">  </p>
<p>&#x63D2;&#x5165;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5148;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x6570;&#x7EC4;&#x8282;&#x70B9;&#x3002;<br>&#x5982;&#x679C;&#x6570;&#x7EC4;&#x8282;&#x70B9;&#x6070;&#x597D;&#x6EE1;&#x4E86;&#xFF0C;&#x9700;&#x8981;&#x62C6;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#xFF0C;&#x6570;&#x636E;&#x5206;&#x4E24;&#x534A;&#xFF0C;&#x7136;&#x540E;&#x786E;&#x5B9A;&#x5E94;&#x8BE5;&#x63D2;&#x5165;&#x5230;&#x90A3;&#x4E2A;&#x6570;&#x7EC4;&#x3002;<br>&#x7136;&#x540E;&#x4F7F;&#x7528;&#x63D2;&#x5165;&#x903B;&#x8F91;&#x63D2;&#x5165;&#x5230;&#x5177;&#x4F53;&#x7684;&#x6570;&#x7EC4;&#x91CC;&#xFF08;&#x6574;&#x4F53;&#x540E;&#x79FB;&#xFF09;&#x3002;   </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/block-link-insert.png" alt="">  </p>
<p>&#x5220;&#x9664;&#x5C31;&#x7B80;&#x5355;&#x4E86;&#xFF0C;&#x76F4;&#x63A5;&#x5148;&#x5220;&#x9664;&#xFF0C;&#x7136;&#x540E;&#x5224;&#x65AD;&#x662F;&#x5426;&#x9700;&#x8981;&#x5408;&#x5E76;&#xFF0C;&#x9700;&#x8981;&#x5C31;&#x5408;&#x5E76;&#x3002;  </p>
<p><img src="http://res.tiankonguse.com/images/2018/09/block-link-remove.png" alt="">  </p>
<p>&#x5206;&#x5757;&#x94FE;&#x8868;&#x7684;&#x5B9E;&#x9645;&#x573A;&#x666F;&#x5F88;&#x591A;&#xFF0C;&#x5982;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;&#x3001;&#x53CC;&#x5411;&#x961F;&#x5217;&#xFF08;&#x7533;&#x8BF7;&#x65B0;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x4E0D;&#x9700;&#x8981;copy&#x5168;&#x91CF;&#x6570;&#x636E;&#xFF09;&#x7B49;&#x3002;  </p>
<h2 id="&#x4E03;&#x3001;&#x6700;&#x540E;">&#x4E03;&#x3001;&#x6700;&#x540E;</h2>
<p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x5355;&#x5411;&#x94FE;&#x8868;&#x3001;&#x53CC;&#x5411;&#x94FE;&#x8868;&#x3001;&#x5FAA;&#x73AF;&#x94FE;&#x8868;&#xFF0C;&#x4E0B;&#x6807;&#x50A8;&#x5B58;&#x65F6;&#x94FE;&#x8868;&#x3001;&#x5206;&#x5757;&#x94FE;&#x8868;&#xFF0C;&#x51E0;&#x4E4E;&#x8986;&#x76D6;&#x4E86;&#x6240;&#x6709;&#x7684;&#x94FE;&#x8868;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;<br>&#x5BF9;&#x4E8E;&#x666E;&#x901A;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5206;&#x5757;&#x94FE;&#x8868;&#x6765;&#x4F18;&#x5316;&#x4E86;&#xFF0C;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x7684;&#x6210;&#x672C;&#x4E0E;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;O(sqrt(n))&#x90FD;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4E86;&#x3002;<br>&#x800C;&#x5BF9;&#x4E8E;&#x6709;&#x5E8F;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x53E6;&#x4E00;&#x79CD;&#x4F18;&#x5316;&#x65B9;&#x5F0F;&#xFF0C;&#x590D;&#x6742;&#x5EA6;&#x53EF;&#x4EE5;&#x4F18;&#x5316;&#x5230;O(log(n))&#xFF0C;&#x4E0B;&#x7BC7;&#x6587;&#x7AE0;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#x3002;  </p>
<p>&#x6CE8;&#xFF1A;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x968F;&#x624B;&#x5FEB;&#x901F;&#x6572;&#x51FA;&#x4E00;&#x4E2A;&#x5E73;&#x8861;&#x6811;&#xFF0C;&#x6216;&#x8005;&#x53D8;&#x79CD;&#x5E73;&#x8861;&#x6811;&#xFF0C;&#x8FD9;&#x4E9B;&#x5176;&#x5B9E;&#x5C0F;&#x4F17;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5176;&#x5B9E;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x4E86;&#x3002;  </p>
<hr>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="full-array.html" class="navigation navigation-prev " aria-label="Previous page: 5. 万能数组">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="skip-list.html" class="navigation navigation-next " aria-label="Next page: 7. 跳表">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"6. 链表","level":"1.7","depth":1,"next":{"title":"7. 跳表","level":"1.8","depth":1,"path":"skip-list.md","ref":"skip-list.md","articles":[]},"previous":{"title":"5. 万能数组","level":"1.6","depth":1,"path":"full-array.md","ref":"full-array.md","articles":[]},"dir":"ltr"},"config":{"plugins":["search","highlight","livereload"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"search":{},"highlight":{},"livereload":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"language ":"zh-hans","theme":"default","author":"tiankonguse","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"从零开始学算法","gitbook":"*","description":"这是一本介绍算法的书籍。虽然名字是从零开始学算法，但是需要你有一定的计算机基础才行。","theme-default":{"showLevel":true}},"file":{"path":"link.md","mtime":"2019-07-11T17:54:13.855Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-07-11T17:56:11.220Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

